[Killed] BlockStatement
src/middlewares/auth.middleware.js:10:21
     try {
         const token = req.cookies?.token;
 
-        if (!token) {
-            return res
-                .status(401)
-                .json({ success: false, message: "Unauthorized request" });
-        }
+        if (!token) {}
 
         const activeSession = await getActiveSessionByToken(token);
killedBy: Auth Middleware: verifyToken Initial Checks should return 401 if token is missing from cookies
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 503

Number of calls: 1

[Killed] ConditionalExpression
src/middlewares/auth.middleware.js:10:13
     try {
         const token = req.cookies?.token;
 
-        if (!token) {
+        if (false) {
             return res
                 .status(401)
killedBy: Auth Middleware: verifyToken Initial Checks should return 401 if token is missing from cookies
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/middlewares/auth.middleware.js:13:34
         if (!token) {
             return res
                 .status(401)
-                .json({ success: false, message: "Unauthorized request" });
+                .json({ success: true, message: "Unauthorized request" });
         }
 
killedBy: Auth Middleware: verifyToken Initial Checks should return 401 if token is missing from cookies
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Unauthorized request",
-   "success": false,

[Killed] ConditionalExpression
src/middlewares/auth.middleware.js:18:13
 
         const activeSession = await getActiveSessionByToken(token);
 
-        if (!activeSession) {
+        if (false) {
             return res
                 .status(503)
killedBy: Auth Middleware: verifyToken Session Validation (getActiveSessionByToken) should return 503 if database error occurs fetching session (returns null/undefined)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 401

Number of calls: 1

[Killed] ConditionalExpression
src/middlewares/auth.middleware.js:18:13
 
         const activeSession = await getActiveSessionByToken(token);
 
-        if (!activeSession) {
+        if (true) {
             return res
                 .status(503)
killedBy: Auth Middleware: verifyToken Session Validation (getActiveSessionByToken) should return 401 and clear cookie if session is valid but empty (length 0)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", {"httpOnly": true, "path": "/", "sameSite": "none", "secure": true}

Number of calls: 0

[Killed] BooleanLiteral
src/middlewares/auth.middleware.js:22:30
             return res
                 .status(503)
                 .json({
-                    success: false,
+                    success: true,
                     message: "Database error while verifying token",
                 });
killedBy: Auth Middleware: verifyToken Session Validation (getActiveSessionByToken) should return 503 if database error occurs fetching session (returns null/undefined)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Database error while verifying token",
-   "success": false,

[Killed] EqualityOperator
src/middlewares/auth.middleware.js:27:13
                 });
         }
 
-        if (activeSession.length == 0) {
+        if (activeSession.length != 0) {
             return res
                 .clearCookie("token", {
killedBy: Auth Middleware: verifyToken Session Validation (getActiveSessionByToken) should return 401 and clear cookie if session is valid but empty (length 0)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", {"httpOnly": true, "path": "/", "sameSite": "none", "secure": true}

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/auth.middleware.js:27:13
                 });
         }
 
-        if (activeSession.length == 0) {
+        if (false) {
             return res
                 .clearCookie("token", {
killedBy: Auth Middleware: verifyToken Session Validation (getActiveSessionByToken) should return 401 and clear cookie if session is valid but empty (length 0)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", {"httpOnly": true, "path": "/", "sameSite": "none", "secure": true}

Number of calls: 0

[Killed] BooleanLiteral
src/middlewares/auth.middleware.js:30:27
         if (activeSession.length == 0) {
             return res
                 .clearCookie("token", {
-                httpOnly: true,
+                httpOnly: false,
                 secure: true,
                 sameSite: "none",
killedBy: Auth Middleware: verifyToken Session Validation (getActiveSessionByToken) should return 401 and clear cookie if session is valid but empty (length 0)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "token",
  Object {
-   "httpOnly": true,

[Killed] BooleanLiteral
src/middlewares/auth.middleware.js:36:34
                 path: "/",
                 })
                 .status(401)
-                .json({ success: false, message: "unauthorized request" });
+                .json({ success: true, message: "unauthorized request" });
         }
 
killedBy: Auth Middleware: verifyToken Session Validation (getActiveSessionByToken) should return 401 and clear cookie if session is valid but empty (length 0)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "unauthorized request",
-   "success": false,

[Killed] EqualityOperator
src/middlewares/auth.middleware.js:52:13
                 });
         }
 
-        if (user.length == 0) {
+        if (user.length != 0) {
             return res
                 .clearCookie("token", {
killedBy: Auth Middleware: verifyToken User Validation (searchUserByEmail) should return 410 and clear cookie if user not found (empty array)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", {"httpOnly": true, "path": "/", "sameSite": "none", "secure": true}

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/auth.middleware.js:52:13
                 });
         }
 
-        if (user.length == 0) {
+        if (false) {
             return res
                 .clearCookie("token", {
killedBy: Auth Middleware: verifyToken User Validation (searchUserByEmail) should return 410 and clear cookie if user not found (empty array)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "token", {"httpOnly": true, "path": "/", "sameSite": "none", "secure": true}

Number of calls: 0

[Killed] BooleanLiteral
src/middlewares/auth.middleware.js:61:34
                 path: "/",
                 })
                 .status(410)
-                .json({ success: false, message: "invalid token" });
+                .json({ success: true, message: "invalid token" });
         }
 
killedBy: Auth Middleware: verifyToken User Validation (searchUserByEmail) should return 410 and clear cookie if user not found (empty array)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "invalid token",
-   "success": false,

[Killed] BlockStatement
src/middlewares/auth.middleware.js:87:21
         };
 
         next();
-    } catch (error) {
-        if (error.name === "TokenExpiredError") {
-            return res
-                .status(401)
-                .json({ success: false, message: "Token expired" });
-        }
-        console.error("auth middleware error:",error);
-        return res.status(401).json({ success: false, message: "error verifying token" });
-    }
+    } catch (error) {}
 };
 
killedBy: Auth Middleware: verifyToken JWT Verification should return 401 if JWT throws TokenExpiredError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 401

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/auth.middleware.js:88:13
 
         next();
     } catch (error) {
-        if (error.name === "TokenExpiredError") {
+        if (false) {
             return res
                 .status(401)
killedBy: Auth Middleware: verifyToken JWT Verification should return 401 if JWT throws TokenExpiredError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Token expired",
+   "message": "error verifying token",

[Killed] BlockStatement
src/middlewares/auth.middleware.js:88:49
 
         next();
     } catch (error) {
-        if (error.name === "TokenExpiredError") {
-            return res
-                .status(401)
-                .json({ success: false, message: "Token expired" });
-        }
+        if (error.name === "TokenExpiredError") {}
         console.error("auth middleware error:",error);
         return res.status(401).json({ success: false, message: "error verifying token" });
killedBy: Auth Middleware: verifyToken JWT Verification should return 401 if JWT throws TokenExpiredError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": "Token expired",
+   "message": "error verifying token",

[Killed] BooleanLiteral
src/middlewares/auth.middleware.js:91:34
         if (error.name === "TokenExpiredError") {
             return res
                 .status(401)
-                .json({ success: false, message: "Token expired" });
+                .json({ success: true, message: "Token expired" });
         }
         console.error("auth middleware error:",error);
killedBy: Auth Middleware: verifyToken JWT Verification should return 401 if JWT throws TokenExpiredError
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Token expired",
-   "success": false,

[Killed] BooleanLiteral
src/middlewares/auth.middleware.js:94:48
                 .json({ success: false, message: "Token expired" });
         }
         console.error("auth middleware error:",error);
-        return res.status(401).json({ success: false, message: "error verifying token" });
+        return res.status(401).json({ success: true, message: "error verifying token" });
     }
 };
killedBy: Auth Middleware: verifyToken JWT Verification should return 401 for any other JWT error (e.g. invalid signature)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "error verifying token",
-   "success": false,
