[Killed] BlockStatement
src/controllers/Portfolio/portfolioFundamentals.controller.js:5:28
 const yahooFinance = new YahooFinance()
 import { getStockSummary } from "../../db/stockSummary.js";
 import { PriceStore } from "../../utils/stores/priceRates.js";
-function formatNumber(num) {
-  if (!num && num !== 0) return "--";
-  if (Math.abs(num) >= 1e12) return (num / 1e12).toFixed(2) + "T";
-  if (Math.abs(num) >= 1e9) return (num / 1e9).toFixed(2) + "B";
-  if (Math.abs(num) >= 1e6) return (num / 1e6).toFixed(2) + "M";
-  return num.toFixed(2);
-}
+function formatNumber(num) {}
 
 export const getPortfolioFundamentals = async (req, res) => {
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully and handle all undefined modules
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 1,
    "data": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:7:7
 import { PriceStore } from "../../utils/stores/priceRates.js";
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
-  if (Math.abs(num) >= 1e12) return (num / 1e12).toFixed(2) + "T";
+  if (false) return (num / 1e12).toFixed(2) + "T";
   if (Math.abs(num) >= 1e9) return (num / 1e9).toFixed(2) + "B";
   if (Math.abs(num) >= 1e6) return (num / 1e6).toFixed(2) + "M";
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method formatNumber utility function coverage should format numbers into T, B, M, --, and fixed decimals (100% coverage)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.00T"
Received: "1000.00B"

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:7:7
 import { PriceStore } from "../../utils/stores/priceRates.js";
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
-  if (Math.abs(num) >= 1e12) return (num / 1e12).toFixed(2) + "T";
+  if (true) return (num / 1e12).toFixed(2) + "T";
   if (Math.abs(num) >= 1e9) return (num / 1e9).toFixed(2) + "B";
   if (Math.abs(num) >= 1e6) return (num / 1e6).toFixed(2) + "M";
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 4

@@ -1,15 +1,16 @@
- ObjectContaining {
-   "avgVolume3M": "1.00M",

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:8:7
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
   if (Math.abs(num) >= 1e12) return (num / 1e12).toFixed(2) + "T";
-  if (Math.abs(num) >= 1e9) return (num / 1e9).toFixed(2) + "B";
+  if (Math.abs(num) > 1e9) return (num / 1e9).toFixed(2) + "B";
   if (Math.abs(num) >= 1e6) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method formatNumber utility function coverage should format numbers into T, B, M, --, and fixed decimals (100% coverage)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "1.00B"
Received: "1000.00M"

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:8:7
 function formatNumber(num) {
   if (!num && num !== 0) return "--";
   if (Math.abs(num) >= 1e12) return (num / 1e12).toFixed(2) + "T";
-  if (Math.abs(num) >= 1e9) return (num / 1e9).toFixed(2) + "B";
+  if (true) return (num / 1e9).toFixed(2) + "B";
   if (Math.abs(num) >= 1e6) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 4

@@ -1,15 +1,16 @@
- ObjectContaining {
-   "avgVolume3M": "1.00M",

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:9:7
   if (!num && num !== 0) return "--";
   if (Math.abs(num) >= 1e12) return (num / 1e12).toFixed(2) + "T";
   if (Math.abs(num) >= 1e9) return (num / 1e9).toFixed(2) + "B";
-  if (Math.abs(num) >= 1e6) return (num / 1e6).toFixed(2) + "M";
+  if (Math.abs(num) > 1e6) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
 }
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

@@ -1,12 +1,13 @@
- ObjectContaining {
-   "avgVolume3M": "1.00M",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:9:7
   if (!num && num !== 0) return "--";
   if (Math.abs(num) >= 1e12) return (num / 1e12).toFixed(2) + "T";
   if (Math.abs(num) >= 1e9) return (num / 1e9).toFixed(2) + "B";
-  if (Math.abs(num) >= 1e6) return (num / 1e6).toFixed(2) + "M";
+  if (false) return (num / 1e6).toFixed(2) + "M";
   return num.toFixed(2);
 }
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

@@ -1,12 +1,13 @@
- ObjectContaining {
-   "avgVolume3M": "1.00M",

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:25:46
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
 
-    const symbols = portfolio.filter(item => item.current_holding > 0).map(stock => stock.symbol);
+    const symbols = portfolio.filter(item => item.current_holding <= 0).map(stock => stock.symbol);
 
     const results = await Promise.allSettled(
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 2,
-   "data": ArrayContaining [

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioFundamentals.controller.js:25:76
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
 
-    const symbols = portfolio.filter(item => item.current_holding > 0).map(stock => stock.symbol);
+    const symbols = portfolio.filter(item => item.current_holding > 0).map(() => undefined);
 
     const results = await Promise.allSettled(
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:50:30
       const summary = result.summaryDetail || {};
       const stats = result.defaultKeyStatistics || {};
       const calendar = result.calendarEvents || {};
-      const currencyChange = PriceStore.get(price.currency) || 1;
+      const currencyChange = false;
       return {
         symbol: price.symbol || symbol,
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 4

- ObjectContaining {
+ Object {
    "avgVolume3M": "1.00M",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:50:30
       const summary = result.summaryDetail || {};
       const stats = result.defaultKeyStatistics || {};
       const calendar = result.calendarEvents || {};
-      const currencyChange = PriceStore.get(price.currency) || 1;
+      const currencyChange = true;
       return {
         symbol: price.symbol || symbol,
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 4

- ObjectContaining {
+ Object {
    "avgVolume3M": "1.00M",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:53:70
       const currencyChange = PriceStore.get(price.currency) || 1;
       return {
         symbol: price.symbol || symbol,
-        lastPrice: (price.regularMarketPrice != null) ? formatNumber(price.regularMarketPrice / currencyChange) : "--",
+        lastPrice: (price.regularMarketPrice != null) ? formatNumber(price.regularMarketPrice * currencyChange) : "--",
         marketCap: price.marketCap ? price.marketCap.toFixed(2) : "--",
         avgVolume3M: formatNumber(summary.averageVolume3Month),
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

@@ -1,15 +1,16 @@
- ObjectContaining {
+ Object {

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioFundamentals.controller.js:53:21
       const currencyChange = PriceStore.get(price.currency) || 1;
       return {
         symbol: price.symbol || symbol,
-        lastPrice: (price.regularMarketPrice != null) ? formatNumber(price.regularMarketPrice / currencyChange) : "--",
+        lastPrice: (true) ? formatNumber(price.regularMarketPrice / currencyChange) : "--",
         marketCap: price.marketCap ? price.marketCap.toFixed(2) : "--",
         avgVolume3M: formatNumber(summary.averageVolume3Month),
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method formatNumber utility function coverage should format numbers into T, B, M, --, and fixed decimals (100% coverage)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "--"
Received: "0.00"

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:58:25
         avgVolume3M: formatNumber(summary.averageVolume3Month),
         epsEstimateNextYear: stats.forwardEps ? stats.forwardEps.toFixed(2) : "--",
         forwardPE: stats.forwardPE ? stats.forwardPE.toFixed(2) : "--",
-        divPaymentDate: calendar.dividendDate ?? "--",
+        divPaymentDate: calendar.dividendDate && "--",
         exDivDate: summary.exDividendDate ?? "--",
         dividendPerShare: summary.dividendRate ?? "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully and handle all undefined modules
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 1,
    "data": Array [

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:62:57
         exDivDate: summary.exDividendDate ?? "--",
         dividendPerShare: summary.dividendRate ?? "--",
         forwardAnnualDivRate: summary.dividendRate ? summary.dividendRate.toFixed(2) : "--",
-        forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
+        forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield / 100).toFixed(2) + "%" : "--",
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ? summary.trailingAnnualDividendRate.toFixed(2) : "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

@@ -1,13 +1,14 @@
- ObjectContaining {
+ Object {

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:64:72
         forwardAnnualDivRate: summary.dividendRate ? summary.dividendRate.toFixed(2) : "--",
         forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ? summary.trailingAnnualDividendRate.toFixed(2) : "--",
-        trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
+        trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield / 100).toFixed(2) + "%" : "--",
         priceToBook: stats.priceToBook ? (stats.priceToBook / currencyChange).toFixed(2) : "--",
         currentHolding: portfolio.find(p => p.symbol === symbol).current_holding
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

- ObjectContaining {
+ Object {
    "avgVolume3M": "1.00M",

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:65:43
         forwardAnnualDivYield: summary.dividendYield ? (summary.dividendYield * 100).toFixed(2) + "%" : "--",
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ? summary.trailingAnnualDividendRate.toFixed(2) : "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
-        priceToBook: stats.priceToBook ? (stats.priceToBook / currencyChange).toFixed(2) : "--",
+        priceToBook: stats.priceToBook ? (stats.priceToBook * currencyChange).toFixed(2) : "--",
         currentHolding: portfolio.find(p => p.symbol === symbol).current_holding
       };
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully, handle currency conversion, and nullish coalescing
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 2
+ Received  + 3

- ObjectContaining {
+ Object {
    "avgVolume3M": "1.00M",

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioFundamentals.controller.js:66:40
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ? summary.trailingAnnualDividendRate.toFixed(2) : "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
         priceToBook: stats.priceToBook ? (stats.priceToBook / currencyChange).toFixed(2) : "--",
-        currentHolding: portfolio.find(p => p.symbol === symbol).current_holding
+        currentHolding: portfolio.find(() => undefined).current_holding
       };
     });
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioFundamentals.controller.js:66:45
         trailingAnnualDivRate: summary.trailingAnnualDividendRate ? summary.trailingAnnualDividendRate.toFixed(2) : "--",
         trailingAnnualDivYield: summary.trailingAnnualDividendYield ? (summary.trailingAnnualDividendYield * 100).toFixed(2) + "%" : "--",
         priceToBook: stats.priceToBook ? (stats.priceToBook / currencyChange).toFixed(2) : "--",
-        currentHolding: portfolio.find(p => p.symbol === symbol).current_holding
+        currentHolding: portfolio.find(p => p.symbol !== symbol).current_holding
       };
     });
killedBy: getPortfolioFundamentals() getPortfolioFundamentals method Happy Paths should return portfolio fundamentals successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "count": 2,
-   "data": ArrayContaining [
