[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:12:12
         
         let { access_token } = req.body;
 
-        if(!access_token)return res.status(400).json({ success: false, message: "access token is required" });
+        if(true)return res.status(400).json({ success: false, message: "access token is required" });
 
         const googleRes = await axios.get(`https://www.googleapis.com/oauth2/v1/userinfo?alt=json&access_token=${access_token}`);
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Google returns no data → exact 504 response and axios called with exact URL
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:12:65
         
         let { access_token } = req.body;
 
-        if(!access_token)return res.status(400).json({ success: false, message: "access token is required" });
+        if(!access_token)return res.status(400).json({ success: true, message: "access token is required" });
 
         const googleRes = await axios.get(`https://www.googleapis.com/oauth2/v1/userinfo?alt=json&access_token=${access_token}`);
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Missing access_token → exact 400 response, no axios call, next not called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "access token is required",
-   "success": false,

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:15:12
         if(!access_token)return res.status(400).json({ success: false, message: "access token is required" });
 
         const googleRes = await axios.get(`https://www.googleapis.com/oauth2/v1/userinfo?alt=json&access_token=${access_token}`);
-        if(!googleRes.data){
+        if(false){
           return res.status(504).json({success:false,message: "Unable to get details from google ouauth"})
         }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Google returns no data → exact 504 response and axios called with exact URL
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 504
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:15:12
         if(!access_token)return res.status(400).json({ success: false, message: "access token is required" });
 
         const googleRes = await axios.get(`https://www.googleapis.com/oauth2/v1/userinfo?alt=json&access_token=${access_token}`);
-        if(!googleRes.data){
+        if(true){
           return res.status(504).json({success:false,message: "Unable to get details from google ouauth"})
         }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests getAllActiveSessionOfUser returns null → exact 503 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:16:48
 
         const googleRes = await axios.get(`https://www.googleapis.com/oauth2/v1/userinfo?alt=json&access_token=${access_token}`);
         if(!googleRes.data){
-          return res.status(504).json({success:false,message: "Unable to get details from google ouauth"})
+          return res.status(504).json({success:true,message: "Unable to get details from google ouauth"})
         }
         const payload = googleRes.data;
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Google returns no data → exact 504 response and axios called with exact URL
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Unable to get details from google ouauth",
-   "success": false,

[Killed] MethodExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:20:17
         }
         const payload = googleRes.data;
         let { email } = payload;
-        email = email.toLowerCase();
+        email = email.toUpperCase();
         //array of active sessions(object)
         const activeSessions = await getAllActiveSessionOfUser(email);
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests getAllActiveSessionOfUser returns null → exact 503 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com"
Received: "TEST@EXAMPLE.COM"

Number of calls: 1

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:23:12
         email = email.toLowerCase();
         //array of active sessions(object)
         const activeSessions = await getAllActiveSessionOfUser(email);
-        if(!activeSessions) {
+        if(activeSessions) {
             return res.status(503).json({ success: false, message: "Database error while getting active session count" });
         }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests getAllActiveSessionOfUser returns null → exact 503 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:23:12
         email = email.toLowerCase();
         //array of active sessions(object)
         const activeSessions = await getAllActiveSessionOfUser(email);
-        if(!activeSessions) {
+        if(true) {
             return res.status(503).json({ success: false, message: "Database error while getting active session count" });
         }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Expired session → jwt.verify throws → deleteActiveSessionByToken called with token and next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:24:52
         //array of active sessions(object)
         const activeSessions = await getAllActiveSessionOfUser(email);
         if(!activeSessions) {
-            return res.status(503).json({ success: false, message: "Database error while getting active session count" });
+            return res.status(503).json({ success: true, message: "Database error while getting active session count" });
         }
 
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests getAllActiveSessionOfUser returns null → exact 503 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Database error while getting active session count",
-   "success": false,

[Killed] EqualityOperator
src/middlewares/verifyUserLoginGoogle.middleware.js:28:21
         }
 
         // remove expired sessions manually
-        for(let i=0;i<activeSessions.length;i++)
+        for(let i=0;i <= activeSessions.length;i++)
         {
             try {
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Expired session → jwt.verify throws → deleteActiveSessionByToken called with token and next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:28:21
         }
 
         // remove expired sessions manually
-        for(let i=0;i<activeSessions.length;i++)
+        for(let i=0;false;i++)
         {
             try {
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Expired session → jwt.verify throws → deleteActiveSessionByToken called with token and next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:29:9
 
         // remove expired sessions manually
         for(let i=0;i<activeSessions.length;i++)
-        {
-            try {
-                jwt.verify(activeSessions[i].token, process.env.JWT_SECRET);
-            } catch (error) {
-                await deleteActiveSessionByToken(activeSessions[i].token);
-                activeSessions.splice(i,1);
-                i--;
-            }
-        }
+        {}
 
         if(!token)
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Expired session → jwt.verify throws → deleteActiveSessionByToken called with token and next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:30:17
         // remove expired sessions manually
         for(let i=0;i<activeSessions.length;i++)
         {
-            try {
-                jwt.verify(activeSessions[i].token, process.env.JWT_SECRET);
-            } catch (error) {
+            try {} catch (error) {
                 await deleteActiveSessionByToken(activeSessions[i].token);
                 activeSessions.splice(i,1);
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Expired session → jwt.verify throws → deleteActiveSessionByToken called with token and next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:32:29
         {
             try {
                 jwt.verify(activeSessions[i].token, process.env.JWT_SECRET);
-            } catch (error) {
-                await deleteActiveSessionByToken(activeSessions[i].token);
-                activeSessions.splice(i,1);
-                i--;
-            }
+            } catch (error) {}
         }
 
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Expired session → jwt.verify throws → deleteActiveSessionByToken called with token and next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] UpdateOperator
src/middlewares/verifyUserLoginGoogle.middleware.js:35:17
             } catch (error) {
                 await deleteActiveSessionByToken(activeSessions[i].token);
                 activeSessions.splice(i,1);
-                i--;
+                i++;
             }
         }

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:39:12
             }
         }
 
-        if(!token)
+        if(token)
         {
             if(activeSessions.length>=5)
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests No cookie token + activeSessions >= 5 → exact 409 response and no next
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:39:12
             }
         }
 
-        if(!token)
+        if(true)
         {
             if(activeSessions.length>=5)
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token matches active session → updateActiveTime called and exact 200 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:40:9
         }
 
         if(!token)
-        {
-            if(activeSessions.length>=5)
-            {
-                return res.status(409).json({ success: false, message: "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue." });
-            }
-            return next();
-        }
+        {}
 
         for(let i=0;i<activeSessions.length;i++)
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests No cookie token + activeSessions >= 5 → exact 409 response and no next
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] EqualityOperator
src/middlewares/verifyUserLoginGoogle.middleware.js:41:16
 
         if(!token)
         {
-            if(activeSessions.length>=5)
+            if(activeSessions.length < 5)
             {
                 return res.status(409).json({ success: false, message: "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue." });
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Expired session → jwt.verify throws → deleteActiveSessionByToken called with token and next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:41:16
 
         if(!token)
         {
-            if(activeSessions.length>=5)
+            if(false)
             {
                 return res.status(409).json({ success: false, message: "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue." });
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests No cookie token + activeSessions >= 5 → exact 409 response and no next
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:42:13
         if(!token)
         {
             if(activeSessions.length>=5)
-            {
-                return res.status(409).json({ success: false, message: "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue." });
-            }
+            {}
             return next();
         }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests No cookie token + activeSessions >= 5 → exact 409 response and no next
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:43:56
         {
             if(activeSessions.length>=5)
             {
-                return res.status(409).json({ success: false, message: "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue." });
+                return res.status(409).json({ success: true, message: "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue." });
             }
             return next();
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests No cookie token + activeSessions >= 5 → exact 409 response and no next
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue.",
-   "success": false,

[Killed] EqualityOperator
src/middlewares/verifyUserLoginGoogle.middleware.js:48:21
             return next();
         }
 
-        for(let i=0;i<activeSessions.length;i++)
+        for(let i=0;i >= activeSessions.length;i++)
         {
             if(activeSessions[i].token==token)
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token matches active session → updateActiveTime called and exact 200 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:48:21
             return next();
         }
 
-        for(let i=0;i<activeSessions.length;i++)
+        for(let i=0;false;i++)
         {
             if(activeSessions[i].token==token)
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token matches active session → updateActiveTime called and exact 200 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:49:9
         }
 
         for(let i=0;i<activeSessions.length;i++)
-        {
-            if(activeSessions[i].token==token)
-            {
-                const updateActiveSessionTimeStatus = await updateActiveTime(token);
-                if(!updateActiveSessionTimeStatus) {
-                    return res.status(503).json({ success: false, message: "Database error while updating active session time" });
-                }
-                return res.status(200).json({ success: true, message: "User is already logged in" });
-            }
-        }
+        {}
         return next();
     }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token matches active session → updateActiveTime called and exact 200 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:50:16
 
         for(let i=0;i<activeSessions.length;i++)
         {
-            if(activeSessions[i].token==token)
+            if(true)
             {
                 const updateActiveSessionTimeStatus = await updateActiveTime(token);
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token exists but not found in DB → next() (no updateActiveTime, no status/json)
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "unknown"

[Killed] EqualityOperator
src/middlewares/verifyUserLoginGoogle.middleware.js:50:16
 
         for(let i=0;i<activeSessions.length;i++)
         {
-            if(activeSessions[i].token==token)
+            if(activeSessions[i].token != token)
             {
                 const updateActiveSessionTimeStatus = await updateActiveTime(token);
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token matches active session → updateActiveTime called and exact 200 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:51:13
         for(let i=0;i<activeSessions.length;i++)
         {
             if(activeSessions[i].token==token)
-            {
-                const updateActiveSessionTimeStatus = await updateActiveTime(token);
-                if(!updateActiveSessionTimeStatus) {
-                    return res.status(503).json({ success: false, message: "Database error while updating active session time" });
-                }
-                return res.status(200).json({ success: true, message: "User is already logged in" });
-            }
+            {}
         }
         return next();
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token matches active session → updateActiveTime called and exact 200 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginGoogle.middleware.js:53:20
             if(activeSessions[i].token==token)
             {
                 const updateActiveSessionTimeStatus = await updateActiveTime(token);
-                if(!updateActiveSessionTimeStatus) {
+                if(false) {
                     return res.status(503).json({ success: false, message: "Database error while updating active session time" });
                 }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests updateActiveTime returns null → exact 503 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 200

Number of calls: 1

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:53:52
             if(activeSessions[i].token==token)
             {
                 const updateActiveSessionTimeStatus = await updateActiveTime(token);
-                if(!updateActiveSessionTimeStatus) {
-                    return res.status(503).json({ success: false, message: "Database error while updating active session time" });
-                }
+                if(!updateActiveSessionTimeStatus) {}
                 return res.status(200).json({ success: true, message: "User is already logged in" });
             }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests updateActiveTime returns null → exact 503 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:54:60
             {
                 const updateActiveSessionTimeStatus = await updateActiveTime(token);
                 if(!updateActiveSessionTimeStatus) {
-                    return res.status(503).json({ success: false, message: "Database error while updating active session time" });
+                    return res.status(503).json({ success: true, message: "Database error while updating active session time" });
                 }
                 return res.status(200).json({ success: true, message: "User is already logged in" });
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests updateActiveTime returns null → exact 503 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Database error while updating active session time",
-   "success": false,

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:56:56
                 if(!updateActiveSessionTimeStatus) {
                     return res.status(503).json({ success: false, message: "Database error while updating active session time" });
                 }
-                return res.status(200).json({ success: true, message: "User is already logged in" });
+                return res.status(200).json({ success: false, message: "User is already logged in" });
             }
         }
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Cookie token matches active session → updateActiveTime called and exact 200 response
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User is already logged in",
-   "success": true,

[Killed] BlockStatement
src/middlewares/verifyUserLoginGoogle.middleware.js:61:19
         }
         return next();
     }
-    catch (error) {
-        console.error(error);
-        return res.status(500).json({ success: false, message: "error while verifying user login status" });
-    }
+    catch (error) {}
 };
 
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Unexpected internal error (axios throws) → exact 500 response and console.error called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/middlewares/verifyUserLoginGoogle.middleware.js:63:48
     }
     catch (error) {
         console.error(error);
-        return res.status(500).json({ success: false, message: "error while verifying user login status" });
+        return res.status(500).json({ success: true, message: "error while verifying user login status" });
     }
 };
killedBy: verifyUserLoginStatusGoogle Middleware — hardened tests Unexpected internal error (axios throws) → exact 500 response and console.error called
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "error while verifying user login status",
-   "success": false,
