[Killed] BlockStatement
src/controllers/Portfolio/portfolioHolding.controller.js:21:47
     }
 
     let portfolio = await getStockSummary(email);
-    if (!portfolio || portfolio.length === 0) {
-      return res.status(404).json({ success: false, message: "No holdings found" });
-    }
+    if (!portfolio || portfolio.length === 0) {}
     portfolio = portfolio.filter(item => item.current_holding > 0);
     const results = await Promise.allSettled(
killedBy: getPortfolioHoldings Controller should return 404 when no holdings exist
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 404
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioHolding.controller.js:21:9
     }
 
     let portfolio = await getStockSummary(email);
-    if (!portfolio || portfolio.length === 0) {
+    if (portfolio || portfolio.length === 0) {
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
killedBy: getPortfolioHoldings Controller should return fallback values when getPrice fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 404

Number of calls: 1

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioHolding.controller.js:24:34
     if (!portfolio || portfolio.length === 0) {
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
-    portfolio = portfolio.filter(item => item.current_holding > 0);
+    portfolio = portfolio.filter(() => undefined);
     const results = await Promise.allSettled(
       portfolio.map(stock =>
killedBy: getPortfolioHoldings Controller should return fallback values when getPrice fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 1,
-   "data": Array [

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioHolding.controller.js:24:42
     if (!portfolio || portfolio.length === 0) {
       return res.status(404).json({ success: false, message: "No holdings found" });
     }
-    portfolio = portfolio.filter(item => item.current_holding > 0);
+    portfolio = portfolio.filter(item => item.current_holding <= 0);
     const results = await Promise.allSettled(
       portfolio.map(stock =>
killedBy: getPortfolioHoldings Controller should return fallback values when getPrice fails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "count": 1,
-   "data": Array [

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioHolding.controller.js:69:17
 
       return {
         symbol: stock.symbol,
-        status: status ?? "UNKNOWN",
+        status: status && "UNKNOWN",
         shares: qty,
         lastPrice: formatNumber(lastPrice),
killedBy: getPortfolioHoldings Controller should return correct calculated portfolio holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -7,11 +7,11 @@
        "dayGainValue": "100.00",
        "lastPrice": "150.00",
