[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:11:63
   try {
     const { email } = req.user;
     const userHoldings = await getStockSummary(email);
-    if (!userHoldings) return res.status(503).json({ success: false, message: "Failed to fetch stock Summary" });
+    if (!userHoldings) return res.status(503).json({ success: true, message: "Failed to fetch stock Summary" });
     if (userHoldings.length === 0) return res.status(200).json({ success: false, summary: [] });
     const filteredHoldings = userHoldings.filter(item => item.current_holding > 0);
killedBy: getSummaryTable Controller should return 503 when getStockSummary returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to fetch stock Summary",
-   "success": false,

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:11:9
   try {
     const { email } = req.user;
     const userHoldings = await getStockSummary(email);
-    if (!userHoldings) return res.status(503).json({ success: false, message: "Failed to fetch stock Summary" });
+    if (userHoldings) return res.status(503).json({ success: false, message: "Failed to fetch stock Summary" });
     if (userHoldings.length === 0) return res.status(200).json({ success: false, summary: [] });
     const filteredHoldings = userHoldings.filter(item => item.current_holding > 0);
killedBy: getSummaryTable Controller should return 503 when getStockSummary returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:12:9
     const { email } = req.user;
     const userHoldings = await getStockSummary(email);
     if (!userHoldings) return res.status(503).json({ success: false, message: "Failed to fetch stock Summary" });
-    if (userHoldings.length === 0) return res.status(200).json({ success: false, summary: [] });
+    if (userHoldings.length !== 0) return res.status(200).json({ success: false, summary: [] });
     const filteredHoldings = userHoldings.filter(item => item.current_holding > 0);
     const results = await Promise.allSettled(
killedBy: getSummaryTable Controller should return empty summary array when no holdings
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": false,
+   "success": true,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:13:58
     const userHoldings = await getStockSummary(email);
     if (!userHoldings) return res.status(503).json({ success: false, message: "Failed to fetch stock Summary" });
     if (userHoldings.length === 0) return res.status(200).json({ success: false, summary: [] });
-    const filteredHoldings = userHoldings.filter(item => item.current_holding > 0);
+    const filteredHoldings = userHoldings.filter(item => item.current_holding >= 0);
     const results = await Promise.allSettled(
       filteredHoldings.map((holding) =>
killedBy: getSummaryTable Controller should ignore holdings where current_holding = 0
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": true,
-   "summary": Array [],

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:13:58
     const userHoldings = await getStockSummary(email);
     if (!userHoldings) return res.status(503).json({ success: false, message: "Failed to fetch stock Summary" });
     if (userHoldings.length === 0) return res.status(200).json({ success: false, summary: [] });
-    const filteredHoldings = userHoldings.filter(item => item.current_holding > 0);
+    const filteredHoldings = userHoldings.filter(item => false);
     const results = await Promise.allSettled(
       filteredHoldings.map((holding) =>
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL", {"modules": ["price", "summaryDetail", "defaultKeyStatistics"]}

Number of calls: 0

[Killed] ArrowFunction
src/controllers/Portfolio/portfolioSummary.controller.js:15:28
     if (userHoldings.length === 0) return res.status(200).json({ success: false, summary: [] });
     const filteredHoldings = userHoldings.filter(item => item.current_holding > 0);
     const results = await Promise.allSettled(
-      filteredHoldings.map((holding) =>
-        yahooFinance.quoteSummary(holding.symbol, {
-          modules: ["price", "summaryDetail", "defaultKeyStatistics"],
-        })
+      filteredHoldings.map(() => undefined
       )
     );
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL", {"modules": ["price", "summaryDetail", "defaultKeyStatistics"]}

Number of calls: 0

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:23:13
     );
     const tableData = results
       .map((resItem, i) => {
-        if (resItem.status !== "fulfilled") return null;
+        if (resItem.status === "fulfilled") return null;
         const price = resItem.value.price;
         const summary = resItem.value.summaryDetail;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL", {"change": 5, "close": 95, "currency": "USD", "current": 100, "expiresAt": Any<Number>, "longname": "Apple Inc", "percentageChange": 5, "shortname": "Apple", "symbol": "AAPL"}

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:23:13
     );
     const tableData = results
       .map((resItem, i) => {
-        if (resItem.status !== "fulfilled") return null;
+        if (false) return null;
         const price = resItem.value.price;
         const summary = resItem.value.summaryDetail;
killedBy: getSummaryTable Controller should skip rejected yahooFinance results
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": true,
-   "summary": Array [],

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:26:13
         if (resItem.status !== "fulfilled") return null;
         const price = resItem.value.price;
         const summary = resItem.value.summaryDetail;
-        if (!summary) throw new Error("Missing summaryDetail");
+        if (true) throw new Error("Missing summaryDetail");
         const currencychange = PriceStore.get(price.currency) || 1;
         const lastPrice = price.regularMarketPrice / currencychange || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL", {"change": 5, "close": 95, "currency": "USD", "current": 100, "expiresAt": Any<Number>, "longname": "Apple Inc", "percentageChange": 5, "shortname": "Apple", "symbol": "AAPL"}

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:26:13
         if (resItem.status !== "fulfilled") return null;
         const price = resItem.value.price;
         const summary = resItem.value.summaryDetail;
-        if (!summary) throw new Error("Missing summaryDetail");
+        if (summary) throw new Error("Missing summaryDetail");
         const currencychange = PriceStore.get(price.currency) || 1;
         const lastPrice = price.regularMarketPrice / currencychange || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL", {"change": 5, "close": 95, "currency": "USD", "current": 100, "expiresAt": Any<Number>, "longname": "Apple Inc", "percentageChange": 5, "shortname": "Apple", "symbol": "AAPL"}

Number of calls: 0

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:27:32
         const price = resItem.value.price;
         const summary = resItem.value.summaryDetail;
         if (!summary) throw new Error("Missing summaryDetail");
-        const currencychange = PriceStore.get(price.currency) || 1;
+        const currencychange = PriceStore.get(price.currency) && 1;
         const lastPrice = price.regularMarketPrice / currencychange || 0;
         const previousClose = price.regularMarketPreviousClose / currencychange || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
-   "change": 5,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:27:32
         const price = resItem.value.price;
         const summary = resItem.value.summaryDetail;
         if (!summary) throw new Error("Missing summaryDetail");
-        const currencychange = PriceStore.get(price.currency) || 1;
+        const currencychange = true;
         const lastPrice = price.regularMarketPrice / currencychange || 0;
         const previousClose = price.regularMarketPreviousClose / currencychange || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
-   "change": 5,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:28:27
         const summary = resItem.value.summaryDetail;
         if (!summary) throw new Error("Missing summaryDetail");
         const currencychange = PriceStore.get(price.currency) || 1;
-        const lastPrice = price.regularMarketPrice / currencychange || 0;
+        const lastPrice = true;
         const previousClose = price.regularMarketPreviousClose / currencychange || 0;
         const change = price.regularMarketChange / currencychange || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 5,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:28:27
         const summary = resItem.value.summaryDetail;
         if (!summary) throw new Error("Missing summaryDetail");
         const currencychange = PriceStore.get(price.currency) || 1;
-        const lastPrice = price.regularMarketPrice / currencychange || 0;
+        const lastPrice = false;
         const previousClose = price.regularMarketPreviousClose / currencychange || 0;
         const change = price.regularMarketChange / currencychange || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 5,

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioSummary.controller.js:29:31
         if (!summary) throw new Error("Missing summaryDetail");
         const currencychange = PriceStore.get(price.currency) || 1;
         const lastPrice = price.regularMarketPrice / currencychange || 0;
-        const previousClose = price.regularMarketPreviousClose / currencychange || 0;
+        const previousClose = price.regularMarketPreviousClose * currencychange || 0;
         const change = price.regularMarketChange / currencychange || 0;
         const changePercent = price.regularMarketChangePercent || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 5,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:29:31
         if (!summary) throw new Error("Missing summaryDetail");
         const currencychange = PriceStore.get(price.currency) || 1;
         const lastPrice = price.regularMarketPrice / currencychange || 0;
-        const previousClose = price.regularMarketPreviousClose / currencychange || 0;
+        const previousClose = true;
         const change = price.regularMarketChange / currencychange || 0;
         const changePercent = price.regularMarketChangePercent || 0;
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
    "change": 5,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:30:24
         const currencychange = PriceStore.get(price.currency) || 1;
         const lastPrice = price.regularMarketPrice / currencychange || 0;
         const previousClose = price.regularMarketPreviousClose / currencychange || 0;
-        const change = price.regularMarketChange / currencychange || 0;
+        const change = price.regularMarketChange / currencychange && 0;
         const changePercent = price.regularMarketChangePercent || 0;
         const currency = price.currency ?? "INR";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "AAPL",
  Object {
-   "change": 5,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:54:24
           expiresAt: Date.now() + 60 * 1000
         });
         const shares = filteredHoldings[i].current_holding;
-        const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
+        const dayLow = typeof summary.dayLow !== "number" ? summary.dayLow / currencychange : "-";
         const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      Object {
        "avgVolume": "200.00K",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:54:24
           expiresAt: Date.now() + 60 * 1000
         });
         const shares = filteredHoldings[i].current_holding;
-        const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
+        const dayLow = true ? summary.dayLow / currencychange : "-";
         const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
killedBy: getSummaryTable Controller should use default fallbacks for missing price fields and currency conversion
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,14 +1,19 @@
  Object {
    "success": true,

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioSummary.controller.js:55:63
         });
         const shares = filteredHoldings[i].current_holding;
         const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
-        const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
+        const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh * currencychange : "-";
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
         const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      Object {
        "avgVolume": "200.00K",

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:55:25
         });
         const shares = filteredHoldings[i].current_holding;
         const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
-        const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
+        const dayHigh = typeof summary.dayHigh !== "number" ? summary.dayHigh / currencychange : "-";
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
         const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      Object {
        "avgVolume": "200.00K",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:56:25
         const shares = filteredHoldings[i].current_holding;
         const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
         const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
-        const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
+        const yearLow = true ? summary.fiftyTwoWeekLow / currencychange : "-";
         const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
         const avgVolume = summary.averageVolume3Month ?? "-";
killedBy: getSummaryTable Controller should handle numeric properties being returned as strings or not existing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
    "summary": Array [

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioSummary.controller.js:56:71
         const shares = filteredHoldings[i].current_holding;
         const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
         const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
-        const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
+        const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow * currencychange : "-";
         const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
         const avgVolume = summary.averageVolume3Month ?? "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,9 +13,9 @@
        "marketTime": "06:38 am",
        "shares": 5,

[Killed] ArithmeticOperator
src/controllers/Portfolio/portfolioSummary.controller.js:57:73
         const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
         const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
-        const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
+        const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh * currencychange : "-";
         const avgVolume = summary.averageVolume3Month ?? "-";
         const volume = price.regularMarketVolume ?? "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,9 +13,9 @@
        "marketTime": "06:38 am",
        "shares": 5,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:57:26
         const dayLow = typeof summary.dayLow === "number" ? summary.dayLow / currencychange : "-";
         const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
-        const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
+        const yearHigh = true ? summary.fiftyTwoWeekHigh / currencychange : "-";
         const avgVolume = summary.averageVolume3Month ?? "-";
         const volume = price.regularMarketVolume ?? "-";
killedBy: getSummaryTable Controller should cover all formatNumber branches
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
    "summary": Array [

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:58:27
         const dayHigh = typeof summary.dayHigh === "number" ? summary.dayHigh / currencychange : "-";
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
         const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
-        const avgVolume = summary.averageVolume3Month ?? "-";
+        const avgVolume = summary.averageVolume3Month && "-";
         const volume = price.regularMarketVolume ?? "-";
         const marketCap = price.marketCap ? price.marketCap : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,

[Killed] LogicalOperator
src/controllers/Portfolio/portfolioSummary.controller.js:59:24
         const yearLow = typeof summary.fiftyTwoWeekLow === "number" ? summary.fiftyTwoWeekLow / currencychange : "-";
         const yearHigh = typeof summary.fiftyTwoWeekHigh === "number" ? summary.fiftyTwoWeekHigh / currencychange : "-";
         const avgVolume = summary.averageVolume3Month ?? "-";
-        const volume = price.regularMarketVolume ?? "-";
+        const volume = price.regularMarketVolume && "-";
         const marketCap = price.marketCap ? price.marketCap : "-";
         const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -12,10 +12,10 @@
        "marketCap": "-",
        "marketTime": "06:38 am",

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:61:28
         const avgVolume = summary.averageVolume3Month ?? "-";
         const volume = price.regularMarketVolume ?? "-";
         const marketCap = price.marketCap ? price.marketCap : "-";
-        const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
+        const safeDayLow = typeof dayLow !== "number" ? dayLow.toFixed(2) : "-";
         const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
         const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      Object {
        "avgVolume": "200.00K",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:61:28
         const avgVolume = summary.averageVolume3Month ?? "-";
         const volume = price.regularMarketVolume ?? "-";
         const marketCap = price.marketCap ? price.marketCap : "-";
-        const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
+        const safeDayLow = false ? dayLow.toFixed(2) : "-";
         const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
         const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      Object {
        "avgVolume": "200.00K",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:62:29
         const volume = price.regularMarketVolume ?? "-";
         const marketCap = price.marketCap ? price.marketCap : "-";
         const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
-        const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
+        const safeDayHigh = true ? dayHigh.toFixed(2) : "-";
         const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
         const safeYearHigh = typeof yearHigh === "number" ? yearHigh.toFixed(2) : "-";
killedBy: getSummaryTable Controller should use default fallbacks for missing price fields and currency conversion
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": true,
-   "summary": Array [

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:62:29
         const volume = price.regularMarketVolume ?? "-";
         const marketCap = price.marketCap ? price.marketCap : "-";
         const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
-        const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
+        const safeDayHigh = false ? dayHigh.toFixed(2) : "-";
         const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
         const safeYearHigh = typeof yearHigh === "number" ? yearHigh.toFixed(2) : "-";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,11 +4,11 @@
      Object {
        "avgVolume": "200.00K",

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:63:29
         const marketCap = price.marketCap ? price.marketCap : "-";
         const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
         const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
-        const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
+        const safeYearLow = true ? yearLow.toFixed(2) : "-";
         const safeYearHigh = typeof yearHigh === "number" ? yearHigh.toFixed(2) : "-";
         return {
killedBy: getSummaryTable Controller should handle numeric properties being returned as strings or not existing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": true,
-   "summary": Array [

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:63:29
         const marketCap = price.marketCap ? price.marketCap : "-";
         const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
         const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
-        const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
+        const safeYearLow = typeof yearLow !== "number" ? yearLow.toFixed(2) : "-";
         const safeYearHigh = typeof yearHigh === "number" ? yearHigh.toFixed(2) : "-";
         return {
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,9 +13,9 @@
        "marketTime": "06:38 am",
        "shares": 5,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:64:30
         const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
         const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
         const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
-        const safeYearHigh = typeof yearHigh === "number" ? yearHigh.toFixed(2) : "-";
+        const safeYearHigh = true ? yearHigh.toFixed(2) : "-";
         return {
           symbol: price.symbol,
killedBy: getSummaryTable Controller should cover all formatNumber branches
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1
