[Killed] ConditionalExpression
src/middlewares/verifyUserLoginStatus.middleware.js:11:12
         
         let { email } = req.body;
 
-        if(!email)return res.status(400).json({ success: false, message: "Email is required" });
+        if(true)return res.status(400).json({ success: false, message: "Email is required" });
 
         //array of active sessions(object)
killedBy: verifyUserLoginStatus Middleware No token + activeSessions < 5 → next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginStatus.middleware.js:11:12
         
         let { email } = req.body;
 
-        if(!email)return res.status(400).json({ success: false, message: "Email is required" });
+        if(false)return res.status(400).json({ success: false, message: "Email is required" });
 
         //array of active sessions(object)
killedBy: verifyUserLoginStatus Middleware Missing email → 400
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 503

Number of calls: 1

[Killed] UpdateOperator
src/middlewares/verifyUserLoginStatus.middleware.js:20:45
         }
 
         // remove expired sessions manually
-        for(let i=0;i<activeSessions.length;i++)
+        for(let i=0;i<activeSessions.length;i--)
         {
             try {
killedBy: verifyUserLoginStatus Middleware No token + activeSessions < 5 → next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginStatus.middleware.js:31:12
             }
         }
 
-        if(!token)
+        if(false)
         {
             if(activeSessions.length>=5)
killedBy: verifyUserLoginStatus Middleware No token + activeSessions >= 5 → 409
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginStatus.middleware.js:33:16
 
         if(!token)
         {
-            if(activeSessions.length>=5)
+            if(true)
             {
                 return res.status(409).json({ success: false, message: "You have reached your limit of 5 active sessions. Please close one of your active sessions to continue." });
killedBy: verifyUserLoginStatus Middleware No token + activeSessions < 5 → next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] UpdateOperator
src/middlewares/verifyUserLoginStatus.middleware.js:40:45
             return next();
         }
 
-        for(let i=0;i<activeSessions.length;i++)
+        for(let i=0;i<activeSessions.length;i--)
         {
             if(activeSessions[i].token==token)
killedBy: verifyUserLoginStatus Middleware Token exists but not found in DB → next()
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginStatus.middleware.js:42:16
 
         for(let i=0;i<activeSessions.length;i++)
         {
-            if(activeSessions[i].token==token)
+            if(false)
             {
                 const updateActiveSessionTimeStatus = await updateActiveTime(token);
killedBy: verifyUserLoginStatus Middleware Token exists + matches activeSession → updateActiveTime + return 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "liveToken"

Number of calls: 0

[Killed] ConditionalExpression
src/middlewares/verifyUserLoginStatus.middleware.js:45:20
             if(activeSessions[i].token==token)
             {
                 const updateActiveSessionTimeStatus = await updateActiveTime(token);
-                if(!updateActiveSessionTimeStatus) {
+                if(true) {
                     return res.status(503).json({ success: false, message: "Database error while updating active session time" });
                 }
killedBy: verifyUserLoginStatus Middleware Token exists + matches activeSession → updateActiveTime + return 200
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 503

Number of calls: 1
