[Killed] BlockStatement
src/db/updatePassword.js:3:57
 import { sql } from "./dbConnection.js";
 
-const updatePassword = async (email, hashedPassword) => {
-    try {
-        const result = await sql`UPDATE "user" SET password=${hashedPassword} WHERE email=${email} RETURNING id, email`;
-        return result;
-    } catch (error) {
-        console.error('Error updating password:', error);
-        return null;
-    }
-}
+const updatePassword = async (email, hashedPassword) => {}
 export { updatePassword };
killedBy: updatePassword should update password and return user info
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/db/updatePassword.js:4:9
 import { sql } from "./dbConnection.js";
 
 const updatePassword = async (email, hashedPassword) => {
-    try {
-        const result = await sql`UPDATE "user" SET password=${hashedPassword} WHERE email=${email} RETURNING id, email`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error updating password:', error);
         return null;
killedBy: updatePassword should update password and return user info
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/db/updatePassword.js:7:21
     try {
         const result = await sql`UPDATE "user" SET password=${hashedPassword} WHERE email=${email} RETURNING id, email`;
         return result;
-    } catch (error) {
-        console.error('Error updating password:', error);
-        return null;
-    }
+    } catch (error) {}
 }
 export { updatePassword };
killedBy: updatePassword should return null if query fails
statusReason: Error: expect(received).toBeNull()

Received: undefined
