[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:64:30
         const safeDayLow = typeof dayLow === "number" ? dayLow.toFixed(2) : "-";
         const safeDayHigh = typeof dayHigh === "number" ? dayHigh.toFixed(2) : "-";
         const safeYearLow = typeof yearLow === "number" ? yearLow.toFixed(2) : "-";
-        const safeYearHigh = typeof yearHigh === "number" ? yearHigh.toFixed(2) : "-";
+        const safeYearHigh = false ? yearHigh.toFixed(2) : "-";
         return {
           symbol: price.symbol,
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -13,9 +13,9 @@
        "marketTime": "06:38 am",
        "shares": 5,

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:83:44
         };
       })
       .filter(Boolean);
-    return res.status(200).json({ success: true, summary: tableData });
+    return res.status(200).json({ success: false, summary: tableData });
   } catch (error) {
     console.error("Error generating holdings table:", error);
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "success": true,

[Killed] BlockStatement
src/controllers/Portfolio/portfolioSummary.controller.js:84:19
       })
       .filter(Boolean);
     return res.status(200).json({ success: true, summary: tableData });
-  } catch (error) {
-    console.error("Error generating holdings table:", error);
-    return res.status(500).json({ success: false, meaasge: error.meaasge });
-  }
+  } catch (error) {}
 };
 
killedBy: getSummaryTable Controller should catch error when summaryDetail missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/Portfolio/portfolioSummary.controller.js:86:44
     return res.status(200).json({ success: true, summary: tableData });
   } catch (error) {
     console.error("Error generating holdings table:", error);
-    return res.status(500).json({ success: false, meaasge: error.meaasge });
+    return res.status(500).json({ success: true, meaasge: error.meaasge });
   }
 };
killedBy: getSummaryTable Controller should catch error when summaryDetail missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "meaasge": undefined,
-   "success": false,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:91:7
 };
 
 function formatNumber(value) {
-  if (!value || typeof value !== "number" || Number.isNaN(value)) return "-";
+  if (true) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:91:7
 };
 
 function formatNumber(value) {
-  if (!value || typeof value !== "number" || Number.isNaN(value)) return "-";
+  if (false) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
killedBy: getSummaryTable Controller should cover all formatNumber branches
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/Portfolio/portfolioSummary.controller.js:94:7
   if (!value || typeof value !== "number" || Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
-  if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
+  if (true) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
   if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:94:7
   if (!value || typeof value !== "number" || Number.isNaN(value)) return "-";
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
-  if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
+  if (abs < 1e9) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
   if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:95:7
   const abs = Math.abs(Number(value));
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
-  if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
+  if (abs < 1e6) return (value / 1e6).toFixed(2) + "M";
   if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
   return value.toFixed(2);
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,

[Killed] EqualityOperator
src/controllers/Portfolio/portfolioSummary.controller.js:96:7
   if (abs >= 1e12) return (value / 1e12).toFixed(2) + "T";
   if (abs >= 1e9) return (value / 1e9).toFixed(2) + "B";
   if (abs >= 1e6) return (value / 1e6).toFixed(2) + "M";
-  if (abs >= 1e3) return (value / 1e3).toFixed(2) + "K";
+  if (abs < 1e3) return (value / 1e3).toFixed(2) + "K";
   return value.toFixed(2);
 }
killedBy: getSummaryTable Controller should return summary table with full correct data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,10 +1,10 @@
  Object {
    "success": true,
