[Killed] LogicalOperator
src/controllers/dashBoard/addTransaction.controller.js:8:31
 export const addTransaction = async (req, res) => {
     let { symbol, quantity,transaction_type } = req.body;
     const email = req.user.email;
-    if (!email || !symbol || (!quantity&&quantity!==0)|| !transaction_type) {
+    if (!email || !symbol || (!quantity || quantity !== 0)|| !transaction_type) {
         console.log(req.body,req.user);
         return res.status(400).json({ success: false, message: "All fields are required" });
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "AAPL", 10, "BUY", Any<Date>

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:8:9
 export const addTransaction = async (req, res) => {
     let { symbol, quantity,transaction_type } = req.body;
     const email = req.user.email;
-    if (!email || !symbol || (!quantity&&quantity!==0)|| !transaction_type) {
+    if (email || !symbol || (!quantity&&quantity!==0)|| !transaction_type) {
         console.log(req.body,req.user);
         return res.status(400).json({ success: false, message: "All fields are required" });
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "AAPL", 10, "BUY", Any<Date>

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:10:48
     const email = req.user.email;
     if (!email || !symbol || (!quantity&&quantity!==0)|| !transaction_type) {
         console.log(req.body,req.user);
-        return res.status(400).json({ success: false, message: "All fields are required" });
+        return res.status(400).json({ success: true, message: "All fields are required" });
     }
     transaction_type = transaction_type.toUpperCase();
killedBy: addTransaction() addTransaction method Edge cases should return 400 if any required field is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "All fields are required",
-   "success": false,

[Killed] MethodExpression
src/controllers/dashBoard/addTransaction.controller.js:12:24
         console.log(req.body,req.user);
         return res.status(400).json({ success: false, message: "All fields are required" });
     }
-    transaction_type = transaction_type.toUpperCase();
+    transaction_type = transaction_type.toLowerCase();
     let check_transaction_type = ['BUY','SELL'];
     if(!check_transaction_type.includes(transaction_type)){
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "AAPL", 10, "BUY", Any<Date>

Number of calls: 0

[Killed] BlockStatement
src/controllers/dashBoard/addTransaction.controller.js:14:59
     }
     transaction_type = transaction_type.toUpperCase();
     let check_transaction_type = ['BUY','SELL'];
-    if(!check_transaction_type.includes(transaction_type)){
-        return res.status(400).json({success:false,message:"Invalid transaction type."});
-    } 
+    if(!check_transaction_type.includes(transaction_type)){} 
     if(typeof quantity !== 'number' || Number.isNaN(quantity)){
         return res.status(400).json({ success: false, message: "Quantity must of valid Type" });
killedBy: addTransaction() addTransaction method Edge cases should return 400 for invalid transaction type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:14:8
     }
     transaction_type = transaction_type.toUpperCase();
     let check_transaction_type = ['BUY','SELL'];
-    if(!check_transaction_type.includes(transaction_type)){
+    if(check_transaction_type.includes(transaction_type)){
         return res.status(400).json({success:false,message:"Invalid transaction type."});
     } 
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "AAPL", 10, "BUY", Any<Date>

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:15:46
     transaction_type = transaction_type.toUpperCase();
     let check_transaction_type = ['BUY','SELL'];
     if(!check_transaction_type.includes(transaction_type)){
-        return res.status(400).json({success:false,message:"Invalid transaction type."});
+        return res.status(400).json({success:true,message:"Invalid transaction type."});
     } 
     if(typeof quantity !== 'number' || Number.isNaN(quantity)){
killedBy: addTransaction() addTransaction method Edge cases should return 400 for invalid transaction type
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Invalid transaction type.",
-   "success": false,

[Killed] EqualityOperator
src/controllers/dashBoard/addTransaction.controller.js:17:8
     if(!check_transaction_type.includes(transaction_type)){
         return res.status(400).json({success:false,message:"Invalid transaction type."});
     } 
-    if(typeof quantity !== 'number' || Number.isNaN(quantity)){
+    if(typeof quantity === 'number' || Number.isNaN(quantity)){
         return res.status(400).json({ success: false, message: "Quantity must of valid Type" });
     }
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "AAPL", 10, "BUY", Any<Date>

Number of calls: 0

[Killed] BlockStatement
src/controllers/dashBoard/addTransaction.controller.js:17:63
     if(!check_transaction_type.includes(transaction_type)){
         return res.status(400).json({success:false,message:"Invalid transaction type."});
     } 
-    if(typeof quantity !== 'number' || Number.isNaN(quantity)){
-        return res.status(400).json({ success: false, message: "Quantity must of valid Type" });
-    }
+    if(typeof quantity !== 'number' || Number.isNaN(quantity)){}
     if (quantity <= 0) {
         return res.status(400).json({ success: false, message: "Quantity must be greater than zero" });
killedBy: addTransaction() addTransaction method Edge cases should return 400 if quantity is string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:18:48
         return res.status(400).json({success:false,message:"Invalid transaction type."});
     } 
     if(typeof quantity !== 'number' || Number.isNaN(quantity)){
-        return res.status(400).json({ success: false, message: "Quantity must of valid Type" });
+        return res.status(400).json({ success: true, message: "Quantity must of valid Type" });
     }
     if (quantity <= 0) {
killedBy: addTransaction() addTransaction method Edge cases should return 400 if quantity is string
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Quantity must of valid Type",
-   "success": false,

[Killed] ConditionalExpression
src/controllers/dashBoard/addTransaction.controller.js:20:9
     if(typeof quantity !== 'number' || Number.isNaN(quantity)){
         return res.status(400).json({ success: false, message: "Quantity must of valid Type" });
     }
-    if (quantity <= 0) {
+    if (true) {
         return res.status(400).json({ success: false, message: "Quantity must be greater than zero" });
     }
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "AAPL", 10, "BUY", Any<Date>

Number of calls: 0

[Timeout] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:21:48
         return res.status(400).json({ success: false, message: "Quantity must of valid Type" });
     }
     if (quantity <= 0) {
-        return res.status(400).json({ success: false, message: "Quantity must be greater than zero" });
+        return res.status(400).json({ success: true, message: "Quantity must be greater than zero" });
     }
     try {

[Killed] BlockStatement
src/controllers/dashBoard/addTransaction.controller.js:23:9
     if (quantity <= 0) {
         return res.status(400).json({ success: false, message: "Quantity must be greater than zero" });
     }
-    try {
-        const now = new Date();
-        const insertResult = await insertTransaction(email, symbol, quantity, transaction_type, now);
-        if (!insertResult) {
-            return res.status(503).json({ success: false, message: "Failed to add transaction" });
-        }
-        if(insertResult.success === false){
-            return res.status(504).json({ success: false, message: insertResult.message });
-        }
-        const newActivity = {
-            os_type: req.activeSession.osType,
-            browser_type: req.activeSession.browserType,
-            type: `${transaction_type} ${symbol} in portfolio`,
-            message: "Made a Transaction by user",
-            token: req.cookies.token,
-        };
-        await addActivityHistory(email, newActivity);
-        return res.status(200).json({ success: true, message: "Transaction added successfully" });
-    }
+    try {}
     catch (error) {
         console.log('Add transaction error:', error);
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "AAPL", 10, "BUY", Any<Date>

Number of calls: 0

[Timeout] ConditionalExpression
src/controllers/dashBoard/addTransaction.controller.js:26:13
     try {
         const now = new Date();
         const insertResult = await insertTransaction(email, symbol, quantity, transaction_type, now);
-        if (!insertResult) {
+        if (true) {
             return res.status(503).json({ success: false, message: "Failed to add transaction" });
         }

[Timeout] ConditionalExpression
src/controllers/dashBoard/addTransaction.controller.js:26:13
     try {
         const now = new Date();
         const insertResult = await insertTransaction(email, symbol, quantity, transaction_type, now);
-        if (!insertResult) {
+        if (false) {
             return res.status(503).json({ success: false, message: "Failed to add transaction" });
         }

[Timeout] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:27:52
         const now = new Date();
         const insertResult = await insertTransaction(email, symbol, quantity, transaction_type, now);
         if (!insertResult) {
-            return res.status(503).json({ success: false, message: "Failed to add transaction" });
+            return res.status(503).json({ success: true, message: "Failed to add transaction" });
         }
         if(insertResult.success === false){

[Killed] EqualityOperator
src/controllers/dashBoard/addTransaction.controller.js:29:12
         if (!insertResult) {
             return res.status(503).json({ success: false, message: "Failed to add transaction" });
         }
-        if(insertResult.success === false){
+        if(insertResult.success !== false){
             return res.status(504).json({ success: false, message: insertResult.message });
         }
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", Any<Object>

Number of calls: 0

[Killed] BlockStatement
src/controllers/dashBoard/addTransaction.controller.js:29:43
         if (!insertResult) {
             return res.status(503).json({ success: false, message: "Failed to add transaction" });
         }
-        if(insertResult.success === false){
-            return res.status(504).json({ success: false, message: insertResult.message });
-        }
+        if(insertResult.success === false){}
         const newActivity = {
             os_type: req.activeSession.osType,
killedBy: addTransaction() addTransaction method Edge cases should return 504 if insertTransaction returns success false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 504
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:30:52
             return res.status(503).json({ success: false, message: "Failed to add transaction" });
         }
         if(insertResult.success === false){
-            return res.status(504).json({ success: false, message: insertResult.message });
+            return res.status(504).json({ success: true, message: insertResult.message });
         }
         const newActivity = {
killedBy: addTransaction() addTransaction method Edge cases should return 504 if insertTransaction returns success false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Some error",
-   "success": false,

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:40:48
             token: req.cookies.token,
         };
         await addActivityHistory(email, newActivity);
-        return res.status(200).json({ success: true, message: "Transaction added successfully" });
+        return res.status(200).json({ success: false, message: "Transaction added successfully" });
     }
     catch (error) {
killedBy: addTransaction() addTransaction method Happy paths should add a transaction successfully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Transaction added successfully",
-   "success": true,

[Killed] BlockStatement
src/controllers/dashBoard/addTransaction.controller.js:42:19
         await addActivityHistory(email, newActivity);
         return res.status(200).json({ success: true, message: "Transaction added successfully" });
     }
-    catch (error) {
-        console.log('Add transaction error:', error);
-        return res.status(500).json({ success: false, message: "Internal server error" });
-    }
+    catch (error) {}
 };
killedBy: addTransaction() addTransaction method Edge cases should return 500 on internal server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/addTransaction.controller.js:44:48
     }
     catch (error) {
         console.log('Add transaction error:', error);
-        return res.status(500).json({ success: false, message: "Internal server error" });
+        return res.status(500).json({ success: true, message: "Internal server error" });
     }
 };
killedBy: addTransaction() addTransaction method Edge cases should return 500 on internal server error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Internal server error",
-   "success": false,
