[Killed] BlockStatement
src/controllers/dashBoard/getNews.controller.js:3:43
 import { getData } from '../../utils/getData.js';
 
-export const getNews = async (req,res) => { 
-    const {query} = req.params;
-    if(!query || query.length<1){
-        return res.status(400).json({success:false,message:"Query is required"})
-    }
-    try {
-        let data = await getData(query);
-        if(!data){
-            return res.status(504).json({success:false,message:"No data found for the given query"})
-        }
-        let news = data.news;
-        return res.status(200).json({success:true,news});
-    } catch (error) {
-        console.log('Error fetching news:', error);
-        return res.status(500).json({success:false,message: "Failed to fetch news"});
-    }
-};
+export const getNews = async (req,res) => {};
killedBy: getNews Controller Validation should return 400 if query param missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] EqualityOperator
src/controllers/dashBoard/getNews.controller.js:5:18
 
 export const getNews = async (req,res) => { 
     const {query} = req.params;
-    if(!query || query.length<1){
+    if(!query || query.length <= 1){
         return res.status(400).json({success:false,message:"Query is required"})
     }
killedBy: getNews Controller Data Fetching should return 200 with news if getData returns valid data with query length 1
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "m"

Number of calls: 0

[Killed] EqualityOperator
src/controllers/dashBoard/getNews.controller.js:5:18
 
 export const getNews = async (req,res) => { 
     const {query} = req.params;
-    if(!query || query.length<1){
+    if(!query || query.length >= 1){
         return res.status(400).json({success:false,message:"Query is required"})
     }
killedBy: getNews Controller Validation should return 400 if query is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 504

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/getNews.controller.js:6:46
 export const getNews = async (req,res) => { 
     const {query} = req.params;
     if(!query || query.length<1){
-        return res.status(400).json({success:false,message:"Query is required"})
+        return res.status(400).json({success:true,message:"Query is required"})
     }
     try {
killedBy: getNews Controller Validation should return 400 if query param missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Query is required",
-   "success": false,

[Killed] BlockStatement
src/controllers/dashBoard/getNews.controller.js:8:9
     if(!query || query.length<1){
         return res.status(400).json({success:false,message:"Query is required"})
     }
-    try {
-        let data = await getData(query);
-        if(!data){
-            return res.status(504).json({success:false,message:"No data found for the given query"})
-        }
-        let news = data.news;
-        return res.status(200).json({success:true,news});
-    } catch (error) {
+    try {} catch (error) {
         console.log('Error fetching news:', error);
         return res.status(500).json({success:false,message: "Failed to fetch news"});
killedBy: getNews Controller Data Fetching should return 504 if getData returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "apple"

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/dashBoard/getNews.controller.js:10:12
     }
     try {
         let data = await getData(query);
-        if(!data){
+        if(false){
             return res.status(504).json({success:false,message:"No data found for the given query"})
         }
killedBy: getNews Controller Data Fetching should return 504 if getData returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 504
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/getNews.controller.js:10:12
     }
     try {
         let data = await getData(query);
-        if(!data){
+        if(data){
             return res.status(504).json({success:false,message:"No data found for the given query"})
         }
killedBy: getNews Controller Data Fetching should return 504 if getData returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 504
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/getNews.controller.js:11:50
     try {
         let data = await getData(query);
         if(!data){
-            return res.status(504).json({success:false,message:"No data found for the given query"})
+            return res.status(504).json({success:true,message:"No data found for the given query"})
         }
         let news = data.news;
killedBy: getNews Controller Data Fetching should return 504 if getData returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "No data found for the given query",
-   "success": false,

[Killed] BooleanLiteral
src/controllers/dashBoard/getNews.controller.js:14:46
             return res.status(504).json({success:false,message:"No data found for the given query"})
         }
         let news = data.news;
-        return res.status(200).json({success:true,news});
+        return res.status(200).json({success:false,news});
     } catch (error) {
         console.log('Error fetching news:', error);
killedBy: getNews Controller Data Fetching should return 200 with news if getData returns valid data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -5,7 +5,7 @@
      },
      Object {

[Killed] BlockStatement
src/controllers/dashBoard/getNews.controller.js:15:21
         }
         let news = data.news;
         return res.status(200).json({success:true,news});
-    } catch (error) {
-        console.log('Error fetching news:', error);
-        return res.status(500).json({success:false,message: "Failed to fetch news"});
-    }
+    } catch (error) {}
 };
killedBy: getNews Controller Error Handling should return 500 if getData throws error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/getNews.controller.js:17:46
         return res.status(200).json({success:true,news});
     } catch (error) {
         console.log('Error fetching news:', error);
-        return res.status(500).json({success:false,message: "Failed to fetch news"});
+        return res.status(500).json({success:true,message: "Failed to fetch news"});
     }
 };
killedBy: getNews Controller Error Handling should return 500 if getData throws error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to fetch news",
-   "success": false,
