[Killed] BlockStatement
src/controllers/dashBoard/portfolioCalculation.controller.js:4:50
 import { getStockSummary } from "../../db/stockSummary.js";
 import { getPrice } from "../../utils/getQuotes.js";
 import { UserPortfolioValuationdaily } from "../../mongoModels/userPortfolioValuation.model.js";
-const safeDivision = (numerator, denominator) => {
-    if (!denominator || denominator === 0) {
-        return "0.00";
-    }
-    return ((numerator / denominator) * 100).toFixed(2);
-};
+const safeDivision = (numerator, denominator) => {};
 
 export const calculatePortfolio = async (req, res) => {
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "overallProfitLoss": "-100.00",
-   "overallProfitLosspercentage": "-100.00",

[Killed] ConditionalExpression
src/controllers/dashBoard/portfolioCalculation.controller.js:5:9
 import { getPrice } from "../../utils/getQuotes.js";
 import { UserPortfolioValuationdaily } from "../../mongoModels/userPortfolioValuation.model.js";
 const safeDivision = (numerator, denominator) => {
-    if (!denominator || denominator === 0) {
+    if (false) {
         return "0.00";
     }
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "overallProfitLoss": "-100.00",
    "overallProfitLosspercentage": "-100.00",

[Killed] EqualityOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:5:25
 import { getPrice } from "../../utils/getQuotes.js";
 import { UserPortfolioValuationdaily } from "../../mongoModels/userPortfolioValuation.model.js";
 const safeDivision = (numerator, denominator) => {
-    if (!denominator || denominator === 0) {
+    if (!denominator || denominator !== 0) {
         return "0.00";
     }
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
    "overallProfitLoss": "-100.00",

[Killed] ArithmeticOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:8:14
     if (!denominator || denominator === 0) {
         return "0.00";
     }
-    return ((numerator / denominator) * 100).toFixed(2);
+    return ((numerator * denominator) * 100).toFixed(2);
 };
 
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
    "overallProfitLoss": "-100.00",

[Killed] ArithmeticOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:8:13
     if (!denominator || denominator === 0) {
         return "0.00";
     }
-    return ((numerator / denominator) * 100).toFixed(2);
+    return (numerator / denominator / 100).toFixed(2);
 };
 
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
    "overallProfitLoss": "-100.00",

[Killed] ConditionalExpression
src/controllers/dashBoard/portfolioCalculation.controller.js:16:13
     try {
         const stockSummary = await getStockSummary(email);
         
-        if (!stockSummary) {
+        if (true) {
             return res.status(503).json({ success: false, message: "Database Error in getting stock summary." });
         }
killedBy: calculatePortfolio 200 → stockSummary empty array returns zeros
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/portfolioCalculation.controller.js:16:13
     try {
         const stockSummary = await getStockSummary(email);
         
-        if (!stockSummary) {
+        if (stockSummary) {
             return res.status(503).json({ success: false, message: "Database Error in getting stock summary." });
         }
killedBy: calculatePortfolio 503 → stockSummary null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/portfolioCalculation.controller.js:17:52
         const stockSummary = await getStockSummary(email);
         
         if (!stockSummary) {
-            return res.status(503).json({ success: false, message: "Database Error in getting stock summary." });
+            return res.status(503).json({ success: true, message: "Database Error in getting stock summary." });
         }
         if( stockSummary.length === 0 ){
killedBy: calculatePortfolio 503 → stockSummary null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Database Error in getting stock summary.",
-   "success": false,

[Killed] ConditionalExpression
src/controllers/dashBoard/portfolioCalculation.controller.js:19:13
         if (!stockSummary) {
             return res.status(503).json({ success: false, message: "Database Error in getting stock summary." });
         }
-        if( stockSummary.length === 0 ){
+        if( false ){
             return res.status(200).json({
                 success: true,
killedBy: calculatePortfolio 200 → stockSummary empty array returns zeros
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "overallProfitLoss": 0,
-   "overallProfitLosspercentage": 0,

[Killed] EqualityOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:19:13
         if (!stockSummary) {
             return res.status(503).json({ success: false, message: "Database Error in getting stock summary." });
         }
-        if( stockSummary.length === 0 ){
+        if( stockSummary.length !== 0 ){
             return res.status(200).json({
                 success: true,
killedBy: calculatePortfolio 200 → stockSummary empty array returns zeros
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "overallProfitLoss": 0,
-   "overallProfitLosspercentage": 0,

[Killed] BlockStatement
src/controllers/dashBoard/portfolioCalculation.controller.js:35:41
         let todayPL = 0;
         let totalspending = 0;
         let totalInvestment = 0;
-        for (const row of stockSummary) {
-            let {symbol, current_holding, spended_amount, yestarday_holding,avg_price } = row;
-            spended_amount = Number(spended_amount)
-            let data = await getPrice(symbol);
-            
-            if(!data){
-                return res.status(504).json({success:true,message: "Failed to get stock data"});
-            }
-            if (data.current === undefined || data.close === undefined) continue;
-            const currentValue = current_holding * data.current;
-            const yesterdayValue = yestarday_holding * data.close;
-            const overallProfit = currentValue - spended_amount;
-            const todayProfit = currentValue - yesterdayValue;
-            const currentInvested = current_holding * avg_price;
-            
-            
-            totalspending += spended_amount;
-            totalValuation += currentValue;
-            overallPL += overallProfit;
-            todayPL += todayProfit;
-            totalInvestment += currentInvested;
-        }
+        for (const row of stockSummary) {}
         const today = new Date().setHours(0, 0, 0, 0);
         
killedBy: calculatePortfolio 504 → getPrice returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 504
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/portfolioCalculation.controller.js:41:54
             let data = await getPrice(symbol);
             
             if(!data){
-                return res.status(504).json({success:true,message: "Failed to get stock data"});
+                return res.status(504).json({success:false,message: "Failed to get stock data"});
             }
             if (data.current === undefined || data.close === undefined) continue;
killedBy: calculatePortfolio 504 → getPrice returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to get stock data",
-   "success": true,

[Killed] ConditionalExpression
src/controllers/dashBoard/portfolioCalculation.controller.js:43:47
             if(!data){
                 return res.status(504).json({success:true,message: "Failed to get stock data"});
             }
-            if (data.current === undefined || data.close === undefined) continue;
+            if (data.current === undefined || false) continue;
             const currentValue = current_holding * data.current;
             const yesterdayValue = yestarday_holding * data.close;
killedBy: calculatePortfolio continue branch → getPrice returns missing fields and 0 data
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "overallProfitLoss": "0.00",
-   "overallProfitLosspercentage": "0.00",

[Killed] EqualityOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:43:47
             if(!data){
                 return res.status(504).json({success:true,message: "Failed to get stock data"});
             }
-            if (data.current === undefined || data.close === undefined) continue;
+            if (data.current === undefined || data.close !== undefined) continue;
             const currentValue = current_holding * data.current;
             const yesterdayValue = yestarday_holding * data.close;
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "overallProfitLoss": "-100.00",
-   "overallProfitLosspercentage": "-100.00",

[Killed] ArithmeticOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:44:34
                 return res.status(504).json({success:true,message: "Failed to get stock data"});
             }
             if (data.current === undefined || data.close === undefined) continue;
-            const currentValue = current_holding * data.current;
+            const currentValue = current_holding / data.current;
             const yesterdayValue = yestarday_holding * data.close;
             const overallProfit = currentValue - spended_amount;
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "overallProfitLoss": "-100.00",
-   "overallProfitLosspercentage": "-100.00",

[Killed] ArithmeticOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:45:36
             }
             if (data.current === undefined || data.close === undefined) continue;
             const currentValue = current_holding * data.current;
-            const yesterdayValue = yestarday_holding * data.close;
+            const yesterdayValue = yestarday_holding / data.close;
             const overallProfit = currentValue - spended_amount;
             const todayProfit = currentValue - yesterdayValue;
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "overallProfitLoss": "-100.00",
    "overallProfitLosspercentage": "-100.00",

[Killed] ArithmeticOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:46:35
             if (data.current === undefined || data.close === undefined) continue;
             const currentValue = current_holding * data.current;
             const yesterdayValue = yestarday_holding * data.close;
-            const overallProfit = currentValue - spended_amount;
+            const overallProfit = currentValue + spended_amount;
             const todayProfit = currentValue - yesterdayValue;
             const currentInvested = current_holding * avg_price;
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
-   "overallProfitLoss": "-100.00",

[Killed] ArithmeticOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:47:33
             const currentValue = current_holding * data.current;
             const yesterdayValue = yestarday_holding * data.close;
             const overallProfit = currentValue - spended_amount;
-            const todayProfit = currentValue - yesterdayValue;
+            const todayProfit = currentValue + yesterdayValue;
             const currentInvested = current_holding * avg_price;
             
killedBy: calculatePortfolio Full success calculation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "overallProfitLoss": "20.00",
    "overallProfitLosspercentage": "20.00",

[Killed] ArithmeticOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:48:37
             const yesterdayValue = yestarday_holding * data.close;
             const overallProfit = currentValue - spended_amount;
             const todayProfit = currentValue - yesterdayValue;
-            const currentInvested = current_holding * avg_price;
+            const currentInvested = current_holding / avg_price;
             
             
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "overallProfitLoss": "-100.00",
    "overallProfitLosspercentage": "-100.00",

[Killed] AssignmentOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:51:13
             const currentInvested = current_holding * avg_price;
             
             
-            totalspending += spended_amount;
+            totalspending -= spended_amount;
             totalValuation += currentValue;
             overallPL += overallProfit;
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
    "overallProfitLoss": "-100.00",

[Killed] AssignmentOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:52:13
             
             
             totalspending += spended_amount;
-            totalValuation += currentValue;
+            totalValuation -= currentValue;
             overallPL += overallProfit;
             todayPL += todayProfit;
killedBy: calculatePortfolio Full success calculation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "overallProfitLoss": "20.00",
    "overallProfitLosspercentage": "20.00",

[Killed] AssignmentOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:53:13
             
             totalspending += spended_amount;
             totalValuation += currentValue;
-            overallPL += overallProfit;
+            overallPL -= overallProfit;
             todayPL += todayProfit;
             totalInvestment += currentInvested;
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,8 @@
  Object {
-   "overallProfitLoss": "-100.00",

[Killed] AssignmentOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:54:13
             totalspending += spended_amount;
             totalValuation += currentValue;
             overallPL += overallProfit;
-            todayPL += todayProfit;
+            todayPL -= todayProfit;
             totalInvestment += currentInvested;
         }
killedBy: calculatePortfolio Full success calculation
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "overallProfitLoss": "20.00",
    "overallProfitLosspercentage": "20.00",

[Killed] AssignmentOperator
src/controllers/dashBoard/portfolioCalculation.controller.js:55:13
             totalValuation += currentValue;
             overallPL += overallProfit;
             todayPL += todayProfit;
-            totalInvestment += currentInvested;
+            totalInvestment -= currentInvested;
         }
         const today = new Date().setHours(0, 0, 0, 0);
killedBy: calculatePortfolio getPrice return 0 fields
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "overallProfitLoss": "-100.00",
    "overallProfitLosspercentage": "-100.00",

[Survived] MethodExpression
src/controllers/dashBoard/portfolioCalculation.controller.js:57:23
             todayPL += todayProfit;
             totalInvestment += currentInvested;
         }
-        const today = new Date().setHours(0, 0, 0, 0);
+        const today = new Date().setMinutes(0, 0, 0, 0);
         
         await UserPortfolioValuationdaily.updateOne(

[Survived] BooleanLiteral
src/controllers/dashBoard/portfolioCalculation.controller.js:62:23
         await UserPortfolioValuationdaily.updateOne(
             { email, date: today },
             { $set: { portfolioValuation: totalValuation.toFixed(2) } },
-            { upsert: true }
+            { upsert: false }
         );
         

[Killed] BlockStatement
src/controllers/dashBoard/portfolioCalculation.controller.js:80:21
             totalInvestment: totalInvestment.toFixed(2),
         });
 
-    } catch (error) {
-        console.error('Portfolio calculation error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while calculating the portfolio." });
-    }
+    } catch (error) {}
 };
 
killedBy: calculatePortfolio 500 → catch block triggered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/portfolioCalculation.controller.js:82:48
 
     } catch (error) {
         console.error('Portfolio calculation error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while calculating the portfolio." });
+        return res.status(500).json({ success: true, message: "An error occurred while calculating the portfolio." });
     }
 };
killedBy: calculatePortfolio 500 → catch block triggered
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "An error occurred while calculating the portfolio.",
-   "success": false,
