[Killed] BlockStatement
src/controllers/dashBoard/stockAllocation.controller.js:8:29
     const { email } = req.user;
     try {
         const stocksSector = await getStocksSector(email);
-        if (!stocksSector ) {
-            return res.status(503).json({ success: false, message: "Failed to get stock from db." });
-        }
+        if (!stocksSector ) {}
         if(stocksSector.length === 0){
             return res.status(200).json({ success: false, labels: [], values: []});
killedBy: getStockAllocation() getStockAllocation method Edge Cases should return 503 if stocksSector is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/stockAllocation.controller.js:8:13
     const { email } = req.user;
     try {
         const stocksSector = await getStocksSector(email);
-        if (!stocksSector ) {
+        if (stocksSector ) {
             return res.status(503).json({ success: false, message: "Failed to get stock from db." });
         }
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/stockAllocation.controller.js:9:52
     try {
         const stocksSector = await getStocksSector(email);
         if (!stocksSector ) {
-            return res.status(503).json({ success: false, message: "Failed to get stock from db." });
+            return res.status(503).json({ success: true, message: "Failed to get stock from db." });
         }
         if(stocksSector.length === 0){
killedBy: getStockAllocation() getStockAllocation method Edge Cases should return 503 if stocksSector is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to get stock from db.",
-   "success": false,

[Killed] EqualityOperator
src/controllers/dashBoard/stockAllocation.controller.js:11:12
         if (!stocksSector ) {
             return res.status(503).json({ success: false, message: "Failed to get stock from db." });
         }
-        if(stocksSector.length === 0){
+        if(stocksSector.length !== 0){
             return res.status(200).json({ success: false, labels: [], values: []});
         }
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "labels": Array [
-     "Technology",

[Killed] BlockStatement
src/controllers/dashBoard/stockAllocation.controller.js:11:38
         if (!stocksSector ) {
             return res.status(503).json({ success: false, message: "Failed to get stock from db." });
         }
-        if(stocksSector.length === 0){
-            return res.status(200).json({ success: false, labels: [], values: []});
-        }
+        if(stocksSector.length === 0){}
         let sectorAllocation = {};
         let totalPortfolioValue = 0;
killedBy: getStockAllocation() getStockAllocation method Edge Cases should handle empty stock sector list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "labels": Array [],
-   "success": false,

[Killed] BooleanLiteral
src/controllers/dashBoard/stockAllocation.controller.js:12:52
             return res.status(503).json({ success: false, message: "Failed to get stock from db." });
         }
         if(stocksSector.length === 0){
-            return res.status(200).json({ success: false, labels: [], values: []});
+            return res.status(200).json({ success: true, labels: [], values: []});
         }
         let sectorAllocation = {};
killedBy: getStockAllocation() getStockAllocation method Edge Cases should handle empty stock sector list
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "labels": Array [],
-   "success": false,

[Killed] BlockStatement
src/controllers/dashBoard/stockAllocation.controller.js:16:43
         }
         let sectorAllocation = {};
         let totalPortfolioValue = 0;
-        for (const stock of stocksSector) {
-            const data = await getPrice(stock.symbol);
-            if (!data) continue;
-            const currentValue = stock.current_holding * data.current;
-            totalPortfolioValue += currentValue;
-            if (sectorAllocation[stock.sector]) {
-                sectorAllocation[stock.sector] += currentValue;
-            } else {
-                sectorAllocation[stock.sector] = currentValue;
-            }
-        }
+        for (const stock of stocksSector) {}
         const labels = Object.keys(sectorAllocation);
         const values = labels.map(label => ((sectorAllocation[label] / totalPortfolioValue) * 100).toFixed(2));
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "labels": Array [
-     "Technology",

[Killed] ConditionalExpression
src/controllers/dashBoard/stockAllocation.controller.js:18:17
         let totalPortfolioValue = 0;
         for (const stock of stocksSector) {
             const data = await getPrice(stock.symbol);
-            if (!data) continue;
+            if (false) continue;
             const currentValue = stock.current_holding * data.current;
             totalPortfolioValue += currentValue;
killedBy: getStockAllocation() getStockAllocation method Edge Cases should handle missing stock price data gracefully
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/stockAllocation.controller.js:18:17
         let totalPortfolioValue = 0;
         for (const stock of stocksSector) {
             const data = await getPrice(stock.symbol);
-            if (!data) continue;
+            if (data) continue;
             const currentValue = stock.current_holding * data.current;
             totalPortfolioValue += currentValue;
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "labels": Array [
-     "Technology",

[Killed] ArithmeticOperator
src/controllers/dashBoard/stockAllocation.controller.js:19:34
         for (const stock of stocksSector) {
             const data = await getPrice(stock.symbol);
             if (!data) continue;
-            const currentValue = stock.current_holding * data.current;
+            const currentValue = stock.current_holding / data.current;
             totalPortfolioValue += currentValue;
             if (sectorAllocation[stock.sector]) {
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for multiple stock sectors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,9 +3,9 @@
      "Technology",
      "Finance",

[Killed] AssignmentOperator
src/controllers/dashBoard/stockAllocation.controller.js:20:13
             const data = await getPrice(stock.symbol);
             if (!data) continue;
             const currentValue = stock.current_holding * data.current;
-            totalPortfolioValue += currentValue;
+            totalPortfolioValue -= currentValue;
             if (sectorAllocation[stock.sector]) {
                 sectorAllocation[stock.sector] += currentValue;
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "labels": Array [
      "Technology",

[Killed] ConditionalExpression
src/controllers/dashBoard/stockAllocation.controller.js:21:17
             if (!data) continue;
             const currentValue = stock.current_holding * data.current;
             totalPortfolioValue += currentValue;
-            if (sectorAllocation[stock.sector]) {
+            if (true) {
                 sectorAllocation[stock.sector] += currentValue;
             } else {
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "labels": Array [
      "Technology",

[Killed] ConditionalExpression
src/controllers/dashBoard/stockAllocation.controller.js:21:17
             if (!data) continue;
             const currentValue = stock.current_holding * data.current;
             totalPortfolioValue += currentValue;
-            if (sectorAllocation[stock.sector]) {
+            if (false) {
                 sectorAllocation[stock.sector] += currentValue;
             } else {
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for multiple stock sectors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,9 +3,9 @@
      "Technology",
      "Finance",

[Killed] AssignmentOperator
src/controllers/dashBoard/stockAllocation.controller.js:22:17
             const currentValue = stock.current_holding * data.current;
             totalPortfolioValue += currentValue;
             if (sectorAllocation[stock.sector]) {
-                sectorAllocation[stock.sector] += currentValue;
+                sectorAllocation[stock.sector] -= currentValue;
             } else {
                 sectorAllocation[stock.sector] = currentValue;
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for multiple stock sectors
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,9 +3,9 @@
      "Technology",
      "Finance",

[Killed] BlockStatement
src/controllers/dashBoard/stockAllocation.controller.js:23:20
             totalPortfolioValue += currentValue;
             if (sectorAllocation[stock.sector]) {
                 sectorAllocation[stock.sector] += currentValue;
-            } else {
-                sectorAllocation[stock.sector] = currentValue;
-            }
+            } else {}
         }
         const labels = Object.keys(sectorAllocation);
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "labels": Array [
-     "Technology",

[Killed] ArrowFunction
src/controllers/dashBoard/stockAllocation.controller.js:28:35
             }
         }
         const labels = Object.keys(sectorAllocation);
-        const values = labels.map(label => ((sectorAllocation[label] / totalPortfolioValue) * 100).toFixed(2));
+        const values = labels.map(() => undefined);
 
         return res.status(200).json({ success: true, labels: labels, values: values });
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "labels": Array [
      "Technology",

[Killed] ArithmeticOperator
src/controllers/dashBoard/stockAllocation.controller.js:28:45
             }
         }
         const labels = Object.keys(sectorAllocation);
-        const values = labels.map(label => ((sectorAllocation[label] / totalPortfolioValue) * 100).toFixed(2));
+        const values = labels.map(label => (sectorAllocation[label] / totalPortfolioValue / 100).toFixed(2));
 
         return res.status(200).json({ success: true, labels: labels, values: values });
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,8 +2,8 @@
    "labels": Array [
      "Technology",

[Killed] BooleanLiteral
src/controllers/dashBoard/stockAllocation.controller.js:30:48
         const labels = Object.keys(sectorAllocation);
         const values = labels.map(label => ((sectorAllocation[label] / totalPortfolioValue) * 100).toFixed(2));
 
-        return res.status(200).json({ success: true, labels: labels, values: values });
+        return res.status(200).json({ success: false, labels: labels, values: values });
     } catch (error) {
         console.log('Stock allocation error:', error);
killedBy: getStockAllocation() getStockAllocation method Happy Paths should return correct allocation for a single stock sector
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "labels": Array [
      "Technology",

[Killed] BlockStatement
src/controllers/dashBoard/stockAllocation.controller.js:31:21
         const values = labels.map(label => ((sectorAllocation[label] / totalPortfolioValue) * 100).toFixed(2));
 
         return res.status(200).json({ success: true, labels: labels, values: values });
-    } catch (error) {
-        console.log('Stock allocation error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while calculating stock allocation." });
-    }
+    } catch (error) {}
 };
killedBy: getStockAllocation() getStockAllocation method Edge Cases should return 500 on unexpected error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/stockAllocation.controller.js:33:48
         return res.status(200).json({ success: true, labels: labels, values: values });
     } catch (error) {
         console.log('Stock allocation error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while calculating stock allocation." });
+        return res.status(500).json({ success: true, message: "An error occurred while calculating stock allocation." });
     }
 };
killedBy: getStockAllocation() getStockAllocation method Edge Cases should return 500 on unexpected error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "An error occurred while calculating stock allocation.",
-   "success": false,
