[Killed] BlockStatement
src/controllers/dashBoard/userStockSummary.controller.js:5:9
 import { getPrice } from "../../utils/getQuotes.js";
 export const userStockSummary = async (req, res) => {
     const email = req.user.email;
-    try {
-        const stockSummary = await getStockSummary(email);
-        if (!stockSummary) {
-            return res.status(503).json({ success: false, message: "Failed to retrieve stock summary" });
-        }
-        const userStockSummary = await Promise.all(
-    stockSummary.map(async ({ symbol, current_holding, avg_price }) => {
-        avg_price = Number(avg_price);
-        current_holding = Number(current_holding);
-        const priceData = await getPrice(symbol);
-        const currentPrice = priceData ? priceData.current : 0;
-        const value = current_holding * currentPrice;
-        return {
-            symbol: symbol,
-            shortName: priceData?.shortname||"--",
-            quantity: current_holding,
-            avg_price: avg_price.toFixed(2),
-            current_price: currentPrice.toFixed(2),
-            value: value.toFixed(2)
-        };
-    }));
-    return res.status(200).json({ success: true, data: userStockSummary });
-    } catch (error) {
+    try {} catch (error) {
         console.error('User stock summary error:', error);
         return res.status(500).json({ success: false, message: "Internal server error" });
killedBy: userStockSummary() controller Happy paths 200 → returns formatted summary for single stock with numbers toFixed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com"

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/dashBoard/userStockSummary.controller.js:7:13
     const email = req.user.email;
     try {
         const stockSummary = await getStockSummary(email);
-        if (!stockSummary) {
+        if (false) {
             return res.status(503).json({ success: false, message: "Failed to retrieve stock summary" });
         }
killedBy: userStockSummary() controller Edge cases 503 → when stockSummary is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] BlockStatement
src/controllers/dashBoard/userStockSummary.controller.js:7:28
     const email = req.user.email;
     try {
         const stockSummary = await getStockSummary(email);
-        if (!stockSummary) {
-            return res.status(503).json({ success: false, message: "Failed to retrieve stock summary" });
-        }
+        if (!stockSummary) {}
         const userStockSummary = await Promise.all(
     stockSummary.map(async ({ symbol, current_holding, avg_price }) => {
killedBy: userStockSummary() controller Edge cases 503 → when stockSummary is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/userStockSummary.controller.js:8:52
     try {
         const stockSummary = await getStockSummary(email);
         if (!stockSummary) {
-            return res.status(503).json({ success: false, message: "Failed to retrieve stock summary" });
+            return res.status(503).json({ success: true, message: "Failed to retrieve stock summary" });
         }
         const userStockSummary = await Promise.all(
killedBy: userStockSummary() controller Edge cases 503 → when stockSummary is null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to retrieve stock summary",
-   "success": false,

[Killed] BlockStatement
src/controllers/dashBoard/userStockSummary.controller.js:11:72
             return res.status(503).json({ success: false, message: "Failed to retrieve stock summary" });
         }
         const userStockSummary = await Promise.all(
-    stockSummary.map(async ({ symbol, current_holding, avg_price }) => {
-        avg_price = Number(avg_price);
-        current_holding = Number(current_holding);
-        const priceData = await getPrice(symbol);
-        const currentPrice = priceData ? priceData.current : 0;
-        const value = current_holding * currentPrice;
-        return {
-            symbol: symbol,
-            shortName: priceData?.shortname||"--",
-            quantity: current_holding,
-            avg_price: avg_price.toFixed(2),
-            current_price: currentPrice.toFixed(2),
-            value: value.toFixed(2)
-        };
-    }));
+    stockSummary.map(async ({ symbol, current_holding, avg_price }) => {}));
     return res.status(200).json({ success: true, data: userStockSummary });
     } catch (error) {
killedBy: userStockSummary() controller Happy paths 200 → returns formatted summary for single stock with numbers toFixed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "AAPL"

Number of calls: 0

[Killed] ArithmeticOperator
src/controllers/dashBoard/userStockSummary.controller.js:16:23
         current_holding = Number(current_holding);
         const priceData = await getPrice(symbol);
         const currentPrice = priceData ? priceData.current : 0;
-        const value = current_holding * currentPrice;
+        const value = current_holding / currentPrice;
         return {
             symbol: symbol,
killedBy: userStockSummary() controller Happy paths 200 → returns formatted summary for single stock with numbers toFixed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -4,10 +4,10 @@
        "avg_price": "40.00",
        "current_price": "60.00",

[Killed] LogicalOperator
src/controllers/dashBoard/userStockSummary.controller.js:19:24
         const value = current_holding * currentPrice;
         return {
             symbol: symbol,
-            shortName: priceData?.shortname||"--",
+            shortName: priceData?.shortname && "--",
             quantity: current_holding,
             avg_price: avg_price.toFixed(2),
killedBy: userStockSummary() controller Happy paths 200 → returns formatted summary for single stock with numbers toFixed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "data": Array [
      Object {

[Killed] ConditionalExpression
src/controllers/dashBoard/userStockSummary.controller.js:19:24
         const value = current_holding * currentPrice;
         return {
             symbol: symbol,
-            shortName: priceData?.shortname||"--",
+            shortName: true,
             quantity: current_holding,
             avg_price: avg_price.toFixed(2),
killedBy: userStockSummary() controller Happy paths 200 → returns formatted summary for single stock with numbers toFixed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -2,11 +2,11 @@
    "data": Array [
      Object {

[Killed] BooleanLiteral
src/controllers/dashBoard/userStockSummary.controller.js:26:44
             value: value.toFixed(2)
         };
     }));
-    return res.status(200).json({ success: true, data: userStockSummary });
+    return res.status(200).json({ success: false, data: userStockSummary });
     } catch (error) {
         console.error('User stock summary error:', error);
killedBy: userStockSummary() controller Happy paths 200 → returns formatted summary for single stock with numbers toFixed
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -7,7 +7,7 @@
        "shortName": "Apple Inc",
        "symbol": "AAPL",

[Killed] BlockStatement
src/controllers/dashBoard/userStockSummary.controller.js:27:21
         };
     }));
     return res.status(200).json({ success: true, data: userStockSummary });
-    } catch (error) {
-        console.error('User stock summary error:', error);
-        return res.status(500).json({ success: false, message: "Internal server error" });
-    }
+    } catch (error) {}
 };
killedBy: userStockSummary() controller Edge cases 500 → on unexpected error in controller
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/userStockSummary.controller.js:29:48
     return res.status(200).json({ success: true, data: userStockSummary });
     } catch (error) {
         console.error('User stock summary error:', error);
-        return res.status(500).json({ success: false, message: "Internal server error" });
+        return res.status(500).json({ success: true, message: "Internal server error" });
     }
 };
killedBy: userStockSummary() controller Edge cases 500 → on unexpected error in controller
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Internal server error",
-   "success": false,
