[Killed] ArrayDeclaration
src/controllers/dashBoard/watchlist.controller.js:7:29
 export const showWatchlist = async (req, res) => {
     const { email } = req.user;
     try {
-        let watchlistData = [];
+        let watchlistData = ["Stryker was here"];
         const watchlist = await getWatchlist(email);
         if(!watchlist){
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,8 +1,9 @@
  Object {
    "success": true,

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:9:12
     try {
         let watchlistData = [];
         const watchlist = await getWatchlist(email);
-        if(!watchlist){
+        if(true){
             return res.status(503).json({ success: false,message: "Failed to fetch watchlist."})
         }
killedBy: watchlist.controller showWatchlist() 200 with empty array when watchlist is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 503

Number of calls: 1

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:9:23
     try {
         let watchlistData = [];
         const watchlist = await getWatchlist(email);
-        if(!watchlist){
-            return res.status(503).json({ success: false,message: "Failed to fetch watchlist."})
-        }
+        if(!watchlist){}
         if(watchlist.length==0){
             return res.status(200).json({ success: true,watchlist: [] })
killedBy: watchlist.controller showWatchlist() 503 when getWatchlist returns null/undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:10:52
         let watchlistData = [];
         const watchlist = await getWatchlist(email);
         if(!watchlist){
-            return res.status(503).json({ success: false,message: "Failed to fetch watchlist."})
+            return res.status(503).json({ success: true,message: "Failed to fetch watchlist."})
         }
         if(watchlist.length==0){
killedBy: watchlist.controller showWatchlist() 503 when getWatchlist returns null/undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to fetch watchlist.",
-   "success": false,

[Killed] EqualityOperator
src/controllers/dashBoard/watchlist.controller.js:12:12
         if(!watchlist){
             return res.status(503).json({ success: false,message: "Failed to fetch watchlist."})
         }
-        if(watchlist.length==0){
+        if(watchlist.length != 0){
             return res.status(200).json({ success: true,watchlist: [] })
         }
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
-   "watchlist": Array [

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:12:12
         if(!watchlist){
             return res.status(503).json({ success: false,message: "Failed to fetch watchlist."})
         }
-        if(watchlist.length==0){
+        if(true){
             return res.status(200).json({ success: true,watchlist: [] })
         }
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
-   "watchlist": Array [

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:13:52
             return res.status(503).json({ success: false,message: "Failed to fetch watchlist."})
         }
         if(watchlist.length==0){
-            return res.status(200).json({ success: true,watchlist: [] })
+            return res.status(200).json({ success: false,watchlist: [] })
         }
         for (const symbol of watchlist) {
killedBy: watchlist.controller showWatchlist() 200 with empty array when watchlist is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "success": true,
+   "success": false,

[Killed] ArrayDeclaration
src/controllers/dashBoard/watchlist.controller.js:13:68
             return res.status(503).json({ success: false,message: "Failed to fetch watchlist."})
         }
         if(watchlist.length==0){
-            return res.status(200).json({ success: true,watchlist: [] })
+            return res.status(200).json({ success: true,watchlist: ["Stryker was here"] })
         }
         for (const symbol of watchlist) {
killedBy: watchlist.controller showWatchlist() 200 with empty array when watchlist is empty
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
-   "watchlist": Array [],

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:15:41
         if(watchlist.length==0){
             return res.status(200).json({ success: true,watchlist: [] })
         }
-        for (const symbol of watchlist) {
-            const data = await getPrice(symbol.symbol);
-            if (!data) return res.status(504).json({ success: false, message: "Failed to fetch stock prices." });
-            watchlistData.push({
-                symbol: symbol.symbol,
-                currentPrice: data.current,
-                currency: data.currency,
-                percentageChange: data.percentageChange,
-                currentchange: data.change,
-                shortName: data.shortname,
-                longName: data.longname,
-                marketcap: data.marketcap,
-                sector: data.sector||"others",
-            });
-        }
+        for (const symbol of watchlist) {}
         watchlistData.sort((a, b) => b.currentPrice - a.currentPrice);
         return res.status(200).json({ success: true, watchlist: watchlistData });
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "success": true,
-   "watchlist": Array [

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:17:63
         }
         for (const symbol of watchlist) {
             const data = await getPrice(symbol.symbol);
-            if (!data) return res.status(504).json({ success: false, message: "Failed to fetch stock prices." });
+            if (!data) return res.status(504).json({ success: true, message: "Failed to fetch stock prices." });
             watchlistData.push({
                 symbol: symbol.symbol,
killedBy: watchlist.controller showWatchlist() 504 with getPrice returning undefined
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to fetch stock prices.",
-   "success": false,

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:17:17
         }
         for (const symbol of watchlist) {
             const data = await getPrice(symbol.symbol);
-            if (!data) return res.status(504).json({ success: false, message: "Failed to fetch stock prices." });
+            if (true) return res.status(504).json({ success: false, message: "Failed to fetch stock prices." });
             watchlistData.push({
                 symbol: symbol.symbol,
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 200
Received: 504

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:27:25
                 shortName: data.shortname,
                 longName: data.longname,
                 marketcap: data.marketcap,
-                sector: data.sector||"others",
+                sector: false,
             });
         }
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,22 +6,22 @@
        "currentPrice": 250,
        "currentchange": -1.25,

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:27:25
                 shortName: data.shortname,
                 longName: data.longname,
                 marketcap: data.marketcap,
-                sector: data.sector||"others",
+                sector: true,
             });
         }
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -6,22 +6,22 @@
        "currentPrice": 250,
        "currentchange": -1.25,

[Survived] ArrowFunction
src/controllers/dashBoard/watchlist.controller.js:30:28
                 sector: data.sector||"others",
             });
         }
-        watchlistData.sort((a, b) => b.currentPrice - a.currentPrice);
+        watchlistData.sort(() => undefined);
         return res.status(200).json({ success: true, watchlist: watchlistData });
     } catch (error) {

[Survived] MethodExpression
src/controllers/dashBoard/watchlist.controller.js:30:9
                 sector: data.sector||"others",
             });
         }
-        watchlistData.sort((a, b) => b.currentPrice - a.currentPrice);
+        watchlistData;
         return res.status(200).json({ success: true, watchlist: watchlistData });
     } catch (error) {

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:31:48
             });
         }
         watchlistData.sort((a, b) => b.currentPrice - a.currentPrice);
-        return res.status(200).json({ success: true, watchlist: watchlistData });
+        return res.status(200).json({ success: false, watchlist: watchlistData });
     } catch (error) {
         console.error('Show watchlist error:', error);
killedBy: watchlist.controller showWatchlist() 200 with sorted data and default sector 'others'
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,7 +1,7 @@
  Object {
-   "success": true,

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:32:21
         }
         watchlistData.sort((a, b) => b.currentPrice - a.currentPrice);
         return res.status(200).json({ success: true, watchlist: watchlistData });
-    } catch (error) {
-        console.error('Show watchlist error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while fetching the watchlist." });
-    }
+    } catch (error) {}
 };
 export const addToWatchlist = async (req, res) => {
killedBy: watchlist.controller showWatchlist() 500 with log db error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:34:48
         return res.status(200).json({ success: true, watchlist: watchlistData });
     } catch (error) {
         console.error('Show watchlist error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while fetching the watchlist." });
+        return res.status(500).json({ success: true, message: "An error occurred while fetching the watchlist." });
     }
 };
killedBy: watchlist.controller showWatchlist() 500 with log db error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "An error occurred while fetching the watchlist.",
-   "success": false,

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:37:51
         return res.status(500).json({ success: false, message: "An error occurred while fetching the watchlist." });
     }
 };
-export const addToWatchlist = async (req, res) => {
-    const { email } = req.user;
-    const { symbol } = req.body;
-    try {
-        if (!symbol) {
-            return res.status(400).json({ success: false, message: "Stock symbol is required." });
-        }
-        const success = await addSymbol(email, symbol);
-        if (!success) {
-            return res.status(503).json({ success: false, message: "Failed to add symbol to watchlist." });
-        }
-        const newActivity = {
-            os_type: req?.activeSession?.osType,
-            browser_type: req?.activeSession?.browserType,
-            type: `add ${symbol} in Watchlist`,
-            message: "Adding stock to Watchlist",
-            token: req?.cookies?.token,
-        };
-        await addActivityHistory(email, newActivity);
-        return res.status(200).json({ success: true, message: "Symbol added to watchlist." });
-    } catch (error) {
-        console.error('Add to watchlist error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while adding to the watchlist." });
-    }
-};
+export const addToWatchlist = async (req, res) => {};
 export const removeFromWatchlist = async (req, res) => {
     const { email } = req.user;
killedBy: watchlist.controller addToWatchlist() 400 when symbol missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:40:9
 export const addToWatchlist = async (req, res) => {
     const { email } = req.user;
     const { symbol } = req.body;
-    try {
-        if (!symbol) {
-            return res.status(400).json({ success: false, message: "Stock symbol is required." });
-        }
-        const success = await addSymbol(email, symbol);
-        if (!success) {
-            return res.status(503).json({ success: false, message: "Failed to add symbol to watchlist." });
-        }
-        const newActivity = {
-            os_type: req?.activeSession?.osType,
-            browser_type: req?.activeSession?.browserType,
-            type: `add ${symbol} in Watchlist`,
-            message: "Adding stock to Watchlist",
-            token: req?.cookies?.token,
-        };
-        await addActivityHistory(email, newActivity);
-        return res.status(200).json({ success: true, message: "Symbol added to watchlist." });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Add to watchlist error:', error);
         return res.status(500).json({ success: false, message: "An error occurred while adding to the watchlist." });
killedBy: watchlist.controller addToWatchlist() 400 when symbol missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:41:22
     const { email } = req.user;
     const { symbol } = req.body;
     try {
-        if (!symbol) {
-            return res.status(400).json({ success: false, message: "Stock symbol is required." });
-        }
+        if (!symbol) {}
         const success = await addSymbol(email, symbol);
         if (!success) {
killedBy: watchlist.controller addToWatchlist() 400 when symbol missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 503

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:41:13
     const { email } = req.user;
     const { symbol } = req.body;
     try {
-        if (!symbol) {
+        if (false) {
             return res.status(400).json({ success: false, message: "Stock symbol is required." });
         }
killedBy: watchlist.controller addToWatchlist() 400 when symbol missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:42:52
     const { symbol } = req.body;
     try {
         if (!symbol) {
-            return res.status(400).json({ success: false, message: "Stock symbol is required." });
+            return res.status(400).json({ success: true, message: "Stock symbol is required." });
         }
         const success = await addSymbol(email, symbol);
killedBy: watchlist.controller addToWatchlist() 400 when symbol missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Stock symbol is required.",
-   "success": false,

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:45:23
             return res.status(400).json({ success: false, message: "Stock symbol is required." });
         }
         const success = await addSymbol(email, symbol);
-        if (!success) {
-            return res.status(503).json({ success: false, message: "Failed to add symbol to watchlist." });
-        }
+        if (!success) {}
         const newActivity = {
             os_type: req?.activeSession?.osType,
killedBy: watchlist.controller addToWatchlist() 503 on db returning false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:45:13
             return res.status(400).json({ success: false, message: "Stock symbol is required." });
         }
         const success = await addSymbol(email, symbol);
-        if (!success) {
+        if (success) {
             return res.status(503).json({ success: false, message: "Failed to add symbol to watchlist." });
         }
killedBy: watchlist.controller addToWatchlist() 200 on success and logs activity
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", ObjectContaining {"type": StringContaining "add AAPL in Watchlist"}

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:46:52
         }
         const success = await addSymbol(email, symbol);
         if (!success) {
-            return res.status(503).json({ success: false, message: "Failed to add symbol to watchlist." });
+            return res.status(503).json({ success: true, message: "Failed to add symbol to watchlist." });
         }
         const newActivity = {
killedBy: watchlist.controller addToWatchlist() 503 on db returning false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Failed to add symbol to watchlist.",
-   "success": false,

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:56:48
             token: req?.cookies?.token,
         };
         await addActivityHistory(email, newActivity);
-        return res.status(200).json({ success: true, message: "Symbol added to watchlist." });
+        return res.status(200).json({ success: false, message: "Symbol added to watchlist." });
     } catch (error) {
         console.error('Add to watchlist error:', error);
killedBy: watchlist.controller addToWatchlist() 200 on success and logs activity
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Symbol added to watchlist.",
-   "success": true,

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:57:21
         };
         await addActivityHistory(email, newActivity);
         return res.status(200).json({ success: true, message: "Symbol added to watchlist." });
-    } catch (error) {
-        console.error('Add to watchlist error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while adding to the watchlist." });
-    }
+    } catch (error) {}
 };
 export const removeFromWatchlist = async (req, res) => {
killedBy: watchlist.controller addToWatchlist() 500 on db faliure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:59:48
         return res.status(200).json({ success: true, message: "Symbol added to watchlist." });
     } catch (error) {
         console.error('Add to watchlist error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while adding to the watchlist." });
+        return res.status(500).json({ success: true, message: "An error occurred while adding to the watchlist." });
     }
 };
killedBy: watchlist.controller addToWatchlist() 500 on db faliure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "An error occurred while adding to the watchlist.",
-   "success": false,

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:65:9
 export const removeFromWatchlist = async (req, res) => {
     const { email } = req.user;
     const { symbol } = req.query;
-    try {
-        if (!symbol) {
-            return res.status(400).json({ success: false, message: "Stock symbol is required." });
-        }
-        const available = await checkpresent(email,symbol);
-        if(available==undefined){
-            return res.status(503).json({success:false,message: "Database Error"});
-        }
-        if(available<=0){
-            return res.status(400).json({success:false,meaasage: "The stock is not present to be removeed."});
-        }
-        const success = await removeSymbol(email, symbol);
-        if (!success) {
-            return res.status(503).json({ success: false, message: "Failed to remove symbol from watchlist." });
-        }
-        const newActivity = {
-            os_type: req.activeSession.osType,
-            browser_type: req.activeSession.browserType,
-            type: `Remove ${symbol} from Watchlist`,
-            message: "Removing stock from Watchlist",
-            token: req.cookies.token,
-        };
-        await addActivityHistory(email, newActivity);
-        return res.status(200).json({ success: true, message: "Symbol removed from watchlist." });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Remove from watchlist error:', error);
         return res.status(500).json({ success: false, message: "An error occurred while removing from the watchlist." });
killedBy: watchlist.controller removeFromWatchlist() 400 when symbol not provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:66:13
     const { email } = req.user;
     const { symbol } = req.query;
     try {
-        if (!symbol) {
+        if (true) {
             return res.status(400).json({ success: false, message: "Stock symbol is required." });
         }
killedBy: watchlist.controller removeFromWatchlist() 400 when stock not present to remove
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "MSFT"

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:70:12
             return res.status(400).json({ success: false, message: "Stock symbol is required." });
         }
         const available = await checkpresent(email,symbol);
-        if(available==undefined){
+        if(false){
             return res.status(503).json({success:false,message: "Database Error"});
         }
killedBy: watchlist.controller removeFromWatchlist() 503 when DB returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 400

Number of calls: 1

[Killed] EqualityOperator
src/controllers/dashBoard/watchlist.controller.js:70:12
             return res.status(400).json({ success: false, message: "Stock symbol is required." });
         }
         const available = await checkpresent(email,symbol);
-        if(available==undefined){
+        if(available != undefined){
             return res.status(503).json({success:false,message: "Database Error"});
         }
killedBy: watchlist.controller removeFromWatchlist() 400 when stock not present to remove
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:71:50
         }
         const available = await checkpresent(email,symbol);
         if(available==undefined){
-            return res.status(503).json({success:false,message: "Database Error"});
+            return res.status(503).json({success:true,message: "Database Error"});
         }
         if(available<=0){
killedBy: watchlist.controller removeFromWatchlist() 503 when DB returns null
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {"message": "Database Error", "success": true}

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:73:12
         if(available==undefined){
             return res.status(503).json({success:false,message: "Database Error"});
         }
-        if(available<=0){
+        if(true){
             return res.status(400).json({success:false,meaasage: "The stock is not present to be removeed."});
         }
killedBy: watchlist.controller removeFromWatchlist() 200 when everything is perfect
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "test@example.com", "MSFT"

Number of calls: 0

[Killed] EqualityOperator
src/controllers/dashBoard/watchlist.controller.js:73:12
         if(available==undefined){
             return res.status(503).json({success:false,message: "Database Error"});
         }
-        if(available<=0){
+        if(available < 0){
             return res.status(400).json({success:false,meaasage: "The stock is not present to be removeed."});
         }
killedBy: watchlist.controller removeFromWatchlist() 400 when stock not present to remove
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 503

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:74:50
             return res.status(503).json({success:false,message: "Database Error"});
         }
         if(available<=0){
-            return res.status(400).json({success:false,meaasage: "The stock is not present to be removeed."});
+            return res.status(400).json({success:true,meaasage: "The stock is not present to be removeed."});
         }
         const success = await removeSymbol(email, symbol);
killedBy: watchlist.controller removeFromWatchlist() 400 when stock not present to remove
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {"meaasage": "The stock is not present to be removeed.", "success": true}

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/dashBoard/watchlist.controller.js:77:13
             return res.status(400).json({success:false,meaasage: "The stock is not present to be removeed."});
         }
         const success = await removeSymbol(email, symbol);
-        if (!success) {
+        if (false) {
             return res.status(503).json({ success: false, message: "Failed to remove symbol from watchlist." });
         }
killedBy: watchlist.controller removeFromWatchlist() 503 when remove symbol return false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 200

Number of calls: 1

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:77:23
             return res.status(400).json({success:false,meaasage: "The stock is not present to be removeed."});
         }
         const success = await removeSymbol(email, symbol);
-        if (!success) {
-            return res.status(503).json({ success: false, message: "Failed to remove symbol from watchlist." });
-        }
+        if (!success) {}
         const newActivity = {
             os_type: req.activeSession.osType,
killedBy: watchlist.controller removeFromWatchlist() 503 when remove symbol return false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 503
Received: 200

Number of calls: 1

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:78:52
         }
         const success = await removeSymbol(email, symbol);
         if (!success) {
-            return res.status(503).json({ success: false, message: "Failed to remove symbol from watchlist." });
+            return res.status(503).json({ success: true, message: "Failed to remove symbol from watchlist." });
         }
         const newActivity = {
killedBy: watchlist.controller removeFromWatchlist() 503 when remove symbol return false
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {"message": "Failed to remove symbol from watchlist.", "success": true}

Number of calls: 1
