[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:88:48
             token: req.cookies.token,
         };
         await addActivityHistory(email, newActivity);
-        return res.status(200).json({ success: true, message: "Symbol removed from watchlist." });
+        return res.status(200).json({ success: false, message: "Symbol removed from watchlist." });
     } catch (error) {
         console.error('Remove from watchlist error:', error);
killedBy: watchlist.controller removeFromWatchlist() 200 when everything is perfect
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": true}
Received: {"message": "Symbol removed from watchlist.", "success": false}

Number of calls: 1

[Killed] BlockStatement
src/controllers/dashBoard/watchlist.controller.js:89:21
         };
         await addActivityHistory(email, newActivity);
         return res.status(200).json({ success: true, message: "Symbol removed from watchlist." });
-    } catch (error) {
-        console.error('Remove from watchlist error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while removing from the watchlist." });
-    }   
+    } catch (error) {}   
 };
killedBy: watchlist.controller removeFromWatchlist() 500 when checkPresent throws error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
src/controllers/dashBoard/watchlist.controller.js:91:48
         return res.status(200).json({ success: true, message: "Symbol removed from watchlist." });
     } catch (error) {
         console.error('Remove from watchlist error:', error);
-        return res.status(500).json({ success: false, message: "An error occurred while removing from the watchlist." });
+        return res.status(500).json({ success: true, message: "An error occurred while removing from the watchlist." });
     }   
 };
killedBy: watchlist.controller removeFromWatchlist() 500 when checkPresent throws error
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"success": false}
Received: {"message": "An error occurred while removing from the watchlist.", "success": true}

Number of calls: 1
