[Killed] BlockStatement
src/db/findUser.js:3:44
 import { sql } from "./dbConnection.js";
 
-const searchUserByEmail = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
-    try {
-        const row = await sql`SELECT * FROM "user" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
-        console.error('Database error - searchUserByEmail',error);
-        return null;
-    }
-};
+const searchUserByEmail = async (email) => {};
 export { searchUserByEmail };
 
killedBy: searchUserByEmail() searchUserByEmail method Happy Paths should return user data when a valid email is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "test@example.com", "id": 1, "name": "Test User"}]
Received: undefined

[Killed] LogicalOperator
src/db/findUser.js:4:8
 import { sql } from "./dbConnection.js";
 
 const searchUserByEmail = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null && email === undefined || email === "") return null;
     try {
         const row = await sql`SELECT * FROM "user" WHERE email = ${email}`;
killedBy: searchUserByEmail() searchUserByEmail method Edge Cases should return null when email is null
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] EqualityOperator
src/db/findUser.js:4:49
 import { sql } from "./dbConnection.js";
 
 const searchUserByEmail = async (email) => {
-    if(email === null || email === undefined || email === "") return null;
+    if(email === null || email === undefined || email !== "") return null;
     try {
         const row = await sql`SELECT * FROM "user" WHERE email = ${email}`;
killedBy: searchUserByEmail() searchUserByEmail method Happy Paths should return user data when a valid email is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "test@example.com", "id": 1, "name": "Test User"}]
Received: null

[Killed] BlockStatement
src/db/findUser.js:5:9
 
 const searchUserByEmail = async (email) => {
     if(email === null || email === undefined || email === "") return null;
-    try {
-        const row = await sql`SELECT * FROM "user" WHERE email = ${email}`;
-        return row;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Database error - searchUserByEmail',error);
         return null;
killedBy: searchUserByEmail() searchUserByEmail method Happy Paths should return user data when a valid email is provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "test@example.com", "id": 1, "name": "Test User"}]
Received: undefined

[Killed] BlockStatement
src/db/findUser.js:8:21
     try {
         const row = await sql`SELECT * FROM "user" WHERE email = ${email}`;
         return row;
-    } catch (error) {
-        console.error('Database error - searchUserByEmail',error);
-        return null;
-    }
+    } catch (error) {}
 };
 export { searchUserByEmail };
killedBy: searchUserByEmail() searchUserByEmail method Edge Cases should return null and log error when database query fails
statusReason: Error: expect(received).toBeNull()

Received: undefined
