[Killed] ConditionalExpression
src/db/insertTransaction.js:8:16
 const yahooFinance = new YahooFinance();
     export const insertTransaction = async (email, symbol, quantity, transaction_type, time) => {
         try {
-            if(transaction_type === "BUY"){
+            if(false){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT * FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Object {
-   "insert": "insertOK",
-   "success": true,

[Killed] ConditionalExpression
src/db/insertTransaction.js:8:16
 const yahooFinance = new YahooFinance();
     export const insertTransaction = async (email, symbol, quantity, transaction_type, time) => {
         try {
-            if(transaction_type === "BUY"){
+            if(true){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT * FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 1) SELL → insufficient holdings → exact error return
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"message": "Insufficient holdings to sell.", "success": false}
Received: null

[Killed] BooleanLiteral
src/db/insertTransaction.js:11:20
             if(transaction_type === "BUY"){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT * FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
-                if(!holding_check){
+                if(holding_check){
                     return {success:false,message:"Database error while checking holdings."};
                 }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Object {
-   "insert": "insertOK",
-   "success": true,

[Killed] BlockStatement
src/db/insertTransaction.js:11:35
             if(transaction_type === "BUY"){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT * FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
-                if(!holding_check){
-                    return {success:false,message:"Database error while checking holdings."};
-                }
+                if(!holding_check){}
                 if(holding_check.length>0){
                     const current_holding = Number(holding_check[0].current_holding);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 17) DB error
statusReason: TypeError: Cannot read properties of null (reading 'success')

[Killed] BooleanLiteral
src/db/insertTransaction.js:12:37
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT * FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
                 if(!holding_check){
-                    return {success:false,message:"Database error while checking holdings."};
+                    return {success:true,message:"Database error while checking holdings."};
                 }
                 if(holding_check.length>0){
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 17) DB error
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/db/insertTransaction.js:14:20
                 if(!holding_check){
                     return {success:false,message:"Database error while checking holdings."};
                 }
-                if(holding_check.length>0){
+                if(false){
                     const current_holding = Number(holding_check[0].current_holding);
                     const avg_price = Number(holding_check[0].avg_price);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"insert": "insertOK", "success": true, "update": "updateOK"}
Received: null

[Killed] EqualityOperator
src/db/insertTransaction.js:14:20
                 if(!holding_check){
                     return {success:false,message:"Database error while checking holdings."};
                 }
-                if(holding_check.length>0){
+                if(holding_check.length <= 0){
                     const current_holding = Number(holding_check[0].current_holding);
                     const avg_price = Number(holding_check[0].avg_price);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"insert": "insertOK", "success": true, "update": "updateOK"}
Received: null

[Killed] ConditionalExpression
src/db/insertTransaction.js:18:24
                     const current_holding = Number(holding_check[0].current_holding);
                     const avg_price = Number(holding_check[0].avg_price);
                     const price = await getPrice(symbol);
-                    if(!price.current){
+                    if(false){
                         return {success:false,message:"Unable to fetch stock price."};
                     }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 5) BUY update → price.current missing → return error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"message": "Unable to fetch stock price.", "success": false}
Received: null

[Killed] BlockStatement
src/db/insertTransaction.js:18:39
                     const current_holding = Number(holding_check[0].current_holding);
                     const avg_price = Number(holding_check[0].avg_price);
                     const price = await getPrice(symbol);
-                    if(!price.current){
-                        return {success:false,message:"Unable to fetch stock price."};
-                    }
+                    if(!price.current){}
                     const totalSpend = quantity * price.current;
                     const new_avg_price = ((avg_price * current_holding) + (price.current * quantity))/(current_holding + quantity);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 5) BUY update → price.current missing → return error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"message": "Unable to fetch stock price.", "success": false}
Received: null

[Killed] BooleanLiteral
src/db/insertTransaction.js:19:41
                     const avg_price = Number(holding_check[0].avg_price);
                     const price = await getPrice(symbol);
                     if(!price.current){
-                        return {success:false,message:"Unable to fetch stock price."};
+                        return {success:true,message:"Unable to fetch stock price."};
                     }
                     const totalSpend = quantity * price.current;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 5) BUY update → price.current missing → return error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "message": "Unable to fetch stock price.",
-   "success": false,

[Killed] ArithmeticOperator
src/db/insertTransaction.js:21:40
                     if(!price.current){
                         return {success:false,message:"Unable to fetch stock price."};
                     }
-                    const totalSpend = quantity * price.current;
+                    const totalSpend = quantity / price.current;
                     const new_avg_price = ((avg_price * current_holding) + (price.current * quantity))/(current_holding + quantity);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 2000
Received array: [10, 0.05, 150, "test@example.com", "AAPL"]

[Killed] ArithmeticOperator
src/db/insertTransaction.js:22:45
                         return {success:false,message:"Unable to fetch stock price."};
                     }
                     const totalSpend = quantity * price.current;
-                    const new_avg_price = ((avg_price * current_holding) + (price.current * quantity))/(current_holding + quantity);
+                    const new_avg_price = ((avg_price / current_holding) + (price.current * quantity))/(current_holding + quantity);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 150
Received array: [10, 2000, 100.5, "test@example.com", "AAPL"]

[Killed] ArithmeticOperator
src/db/insertTransaction.js:22:44
                         return {success:false,message:"Unable to fetch stock price."};
                     }
                     const totalSpend = quantity * price.current;
-                    const new_avg_price = ((avg_price * current_holding) + (price.current * quantity))/(current_holding + quantity);
+                    const new_avg_price = (avg_price * current_holding - price.current * quantity)/(current_holding + quantity);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 150
Received array: [10, 2000, -50, "test@example.com", "AAPL"]

[Killed] BooleanLiteral
src/db/insertTransaction.js:26:37
                     const [insert,update] = await sql.transaction(queries);
-                    return {success:true,insert, update};
+                    return {success:false,insert, update};
                 }else{
                     let price;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 4) BUY update → correct avg_price & spend computed exactly
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "insert": "insertOK",
-   "success": true,

[Killed] EqualityOperator
src/db/insertTransaction.js:30:24
                 }else{
                     let price;
                     const existingStock = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
-                    if(existingStock.length===0){
+                    if(existingStock.length !== 0){
                         const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
                         if (!quoteSummary.price) {
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 6) BUY new → YahooFinance used → insert stock
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"insert": "insert", "success": true, "update": "update"}
Received: null

[Killed] ConditionalExpression
src/db/insertTransaction.js:30:24
                 }else{
                     let price;
                     const existingStock = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
-                    if(existingStock.length===0){
+                    if(true){
                         const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
                         if (!quoteSummary.price) {
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 8) BUY new → stock exists → use getPrice instead of Yahoo
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "AAPL", {"modules": ["assetProfile", "price"]}

[Killed] ConditionalExpression
src/db/insertTransaction.js:32:29
                     const existingStock = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
                     if(existingStock.length===0){
                         const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
-                        if (!quoteSummary.price) {
+                        if (false) {
                             return { success: false, message: "Unable to fetch stock details." };
                         }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 7) BUY new → Yahoo missing price → return exact error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"message": "Unable to fetch stock details.", "success": false}
Received: null

[Killed] ConditionalExpression
src/db/insertTransaction.js:32:29
                     const existingStock = await sql`SELECT * FROM "stocks" WHERE symbol=${symbol}`;
                     if(existingStock.length===0){
                         const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
-                        if (!quoteSummary.price) {
+                        if (true) {
                             return { success: false, message: "Unable to fetch stock details." };
                         }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 6) BUY new → YahooFinance used → insert stock
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Object {
-   "insert": "insert",
-   "success": true,

[Killed] BooleanLiteral
src/db/insertTransaction.js:33:47
                     if(existingStock.length===0){
                         const quoteSummary = await yahooFinance.quoteSummary(symbol, {modules: ["assetProfile", "price"]});
                         if (!quoteSummary.price) {
-                            return { success: false, message: "Unable to fetch stock details." };
+                            return { success: true, message: "Unable to fetch stock details." };
                         }
                         const {
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 7) BUY new → Yahoo missing price → return exact error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "message": "Unable to fetch stock details.",
-   "success": false,

[Survived] LogicalOperator
src/db/insertTransaction.js:44:40
                             market: country,
                             regularMarketPrice,
                         } = quoteSummary.price;
-                        const sector = quoteSummary.assetProfile?.sector ?? "N/A";
+                        const sector = quoteSummary.assetProfile?.sector && "N/A";
                         price = {
                             current:regularMarketPrice / PriceStore.get(currency)

[Killed] ArithmeticOperator
src/db/insertTransaction.js:46:37
                         } = quoteSummary.price;
                         const sector = quoteSummary.assetProfile?.sector ?? "N/A";
                         price = {
-                            current:regularMarketPrice / PriceStore.get(currency)
+                            current:regularMarketPrice * PriceStore.get(currency)
                         };
                         await sql`
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 9) BUY new → convert Yahoo price using PriceStore
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 50
Received array: ["test@example.com", "AAPL", 1, 450, "BUY", "2024-01-01T00:00:00.000Z"]

[Killed] ConditionalExpression
src/db/insertTransaction.js:55:29
                             RETURNING *;
                         `;
                     }
-                    price = price || await getPrice(symbol);
+                    price = true;
                     if(!price.current){
                         return {success:false,message:"Unable to fetch stock price."};
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 6) BUY new → YahooFinance used → insert stock
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Object {
-   "insert": "insert",
-   "success": true,

[Killed] LogicalOperator
src/db/insertTransaction.js:55:29
                             RETURNING *;
                         `;
                     }
-                    price = price || await getPrice(symbol);
+                    price = price && (await getPrice(symbol));
                     if(!price.current){
                         return {success:false,message:"Unable to fetch stock price."};
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 6) BUY new → YahooFinance used → insert stock
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"insert": "insert", "success": true, "update": "update"}
Received: null

[Killed] BlockStatement
src/db/insertTransaction.js:56:39
                         `;
                     }
                     price = price || await getPrice(symbol);
-                    if(!price.current){
-                        return {success:false,message:"Unable to fetch stock price."};
-                    }
+                    if(!price.current){}
                     const avg_Price = price.current;
                     const totalSpend = quantity * price.current;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 12) BUY new → Yahoo provided no price, getPrice returns missing current → return exact error
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"message": "Unable to fetch stock price.", "success": false}
Received: null

[Killed] BooleanLiteral
src/db/insertTransaction.js:56:24
                         `;
                     }
                     price = price || await getPrice(symbol);
-                    if(!price.current){
+                    if(price.current){
                         return {success:false,message:"Unable to fetch stock price."};
                     }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 6) BUY new → YahooFinance used → insert stock
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 2

  Object {
-   "insert": "insert",
-   "success": true,

[Survived] ArithmeticOperator
src/db/insertTransaction.js:60:40
                         return {success:false,message:"Unable to fetch stock price."};
                     }
                     const avg_Price = price.current;
-                    const totalSpend = quantity * price.current;
+                    const totalSpend = quantity / price.current;
                     RETURNING *;`,sql`INSERT INTO "stock_summary" (email, symbol, current_holding, spended_amount, avg_price)

[Killed] EqualityOperator
src/db/insertTransaction.js:67:22
                     const [insert,update] = await sql.transaction(queries);
                     return {success:true,insert, update};
                 }
-            }else if(transaction_type === "SELL"){
+            }else if(transaction_type !== "SELL"){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT spended_amount,current_holding,avg_price FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 1) SELL → insufficient holdings → exact error return
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Insufficient holdings to sell.",
+   "message": "Invalid transaction type.",

[Killed] ConditionalExpression
src/db/insertTransaction.js:67:22
                     const [insert,update] = await sql.transaction(queries);
                     return {success:true,insert, update};
                 }
-            }else if(transaction_type === "SELL"){
+            }else if(false){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT spended_amount,current_holding,avg_price FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 1) SELL → insufficient holdings → exact error return
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Insufficient holdings to sell.",
+   "message": "Invalid transaction type.",

[Killed] BooleanLiteral
src/db/insertTransaction.js:70:20
             }else if(transaction_type === "SELL"){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT spended_amount,current_holding,avg_price FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
-                if(!holding_check){
+                if(holding_check){
                     return {success:false,message:"Database error while checking holdings."};
                 }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 1) SELL → insufficient holdings → exact error return
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "message": "Insufficient holdings to sell.",
+   "message": "Database error while checking holdings.",

[Killed] BlockStatement
src/db/insertTransaction.js:70:35
             }else if(transaction_type === "SELL"){
                 quantity = Number(quantity);
                 const holding_check = await sql`SELECT spended_amount,current_holding,avg_price FROM "stock_summary" WHERE email=${email} AND symbol=${symbol}`;
-                if(!holding_check){
-                    return {success:false,message:"Database error while checking holdings."};
-                }
+                if(!holding_check){}
                 if(holding_check.length===0 || holding_check[0].current_holding<quantity){
                     return {success:false,message:"Insufficient holdings to sell."};
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 16) DB error
statusReason: TypeError: Cannot read properties of null (reading 'success')

[Killed] EqualityOperator
src/db/insertTransaction.js:73:48
                 if(!holding_check){
                     return {success:false,message:"Database error while checking holdings."};
                 }
-                if(holding_check.length===0 || holding_check[0].current_holding<quantity){
+                if(holding_check.length===0 || holding_check[0].current_holding <= quantity){
                     return {success:false,message:"Insufficient holdings to sell."};
                 }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 2) SELL → exact holdings match → success
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 2

  Object {
-   "insert": Object {
-     "insert": true,

[Killed] EqualityOperator
src/db/insertTransaction.js:73:48
                 if(!holding_check){
                     return {success:false,message:"Database error while checking holdings."};
                 }
-                if(holding_check.length===0 || holding_check[0].current_holding<quantity){
+                if(holding_check.length===0 || holding_check[0].current_holding >= quantity){
                     return {success:false,message:"Insufficient holdings to sell."};
                 }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 1) SELL → insufficient holdings → exact error return
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

Expected: {"message": "Insufficient holdings to sell.", "success": false}
Received: null

[Killed] BooleanLiteral
src/db/insertTransaction.js:74:37
                     return {success:false,message:"Database error while checking holdings."};
                 }
                 if(holding_check.length===0 || holding_check[0].current_holding<quantity){
-                    return {success:false,message:"Insufficient holdings to sell."};
+                    return {success:true,message:"Insufficient holdings to sell."};
                 }
                 const current_holding = Number(holding_check[0].current_holding);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 1) SELL → insufficient holdings → exact error return
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
    "message": "Insufficient holdings to sell.",
-   "success": false,

[Killed] ConditionalExpression
src/db/insertTransaction.js:79:20
                 const current_holding = Number(holding_check[0].current_holding);
                 const avg_price = Number(holding_check[0].avg_price);
                 const price = await getPrice(symbol);
-                if(!price.current){
+                if(true){
                     return {success:false,message:"Unable to fetch stock price."};
                 }
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 2) SELL → exact holdings match → success
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 7
+ Received  + 2

  Object {
-   "insert": Object {
-     "insert": true,

[Survived] ArithmeticOperator
src/db/insertTransaction.js:82:36
                 if(!price.current){
                     return {success:false,message:"Unable to fetch stock price."};
                 }
-                const totalSpend = price.current * quantity;
+                const totalSpend = price.current / quantity;
                 const profit = (price.current - avg_price) * quantity;
                 let new_avg_price = (avg_price * current_holding - totalSpend)/(current_holding - quantity);

[Killed] ArithmeticOperator
src/db/insertTransaction.js:83:33
                     return {success:false,message:"Unable to fetch stock price."};
                 }
                 const totalSpend = price.current * quantity;
-                const profit = (price.current - avg_price) * quantity;
+                const profit = (price.current + avg_price) * quantity;
                 let new_avg_price = (avg_price * current_holding - totalSpend)/(current_holding - quantity);
                 if(Number.isNaN(new_avg_price)||(current_holding === quantity)) new_avg_price = 0;
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 14) SELL half holding → new_avg_price becomes NaN → sets avg_price = 0
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: 0
Received array: [10, 1000, 100, 2000, "test@example.com", "AAPL"]

[Survived] ArithmeticOperator
src/db/insertTransaction.js:83:32
                     return {success:false,message:"Unable to fetch stock price."};
                 }
                 const totalSpend = price.current * quantity;
-                const profit = (price.current - avg_price) * quantity;
+                const profit = (price.current - avg_price) / quantity;
                 let new_avg_price = (avg_price * current_holding - totalSpend)/(current_holding - quantity);
                 if(Number.isNaN(new_avg_price)||(current_holding === quantity)) new_avg_price = 0;

[Survived] ArithmeticOperator
src/db/insertTransaction.js:84:38
                 }
                 const totalSpend = price.current * quantity;
                 const profit = (price.current - avg_price) * quantity;
-                let new_avg_price = (avg_price * current_holding - totalSpend)/(current_holding - quantity);
+                let new_avg_price = (avg_price * current_holding + totalSpend)/(current_holding - quantity);
                 if(Number.isNaN(new_avg_price)||(current_holding === quantity)) new_avg_price = 0;

[Survived] ArithmeticOperator
src/db/insertTransaction.js:84:38
                 }
                 const totalSpend = price.current * quantity;
                 const profit = (price.current - avg_price) * quantity;
-                let new_avg_price = (avg_price * current_holding - totalSpend)/(current_holding - quantity);
+                let new_avg_price = (avg_price / current_holding - totalSpend)/(current_holding - quantity);
                 if(Number.isNaN(new_avg_price)||(current_holding === quantity)) new_avg_price = 0;

[Survived] ConditionalExpression
src/db/insertTransaction.js:85:20
                 const totalSpend = price.current * quantity;
                 const profit = (price.current - avg_price) * quantity;
                 let new_avg_price = (avg_price * current_holding - totalSpend)/(current_holding - quantity);
-                if(Number.isNaN(new_avg_price)||(current_holding === quantity)) new_avg_price = 0;
+                if(true) new_avg_price = 0;

[Survived] EqualityOperator
src/db/insertTransaction.js:85:50
                 const totalSpend = price.current * quantity;
                 const profit = (price.current - avg_price) * quantity;
                 let new_avg_price = (avg_price * current_holding - totalSpend)/(current_holding - quantity);
-                if(Number.isNaN(new_avg_price)||(current_holding === quantity)) new_avg_price = 0;
+                if(Number.isNaN(new_avg_price)||(current_holding !== quantity)) new_avg_price = 0;
