[Killed] BlockStatement
src/db/insertTransaction.js:90:18
                 const [insert,update] = await sql.transaction(queries);
                 return {success:true,insert, update};
-            }else{
-                return {success:false,message:"Invalid transaction type."};
-            }
+            }else{}
         } catch (error) {
             console.error('Error inserting transaction:', error);
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 15) invalid Transaction type
statusReason: TypeError: Cannot read properties of undefined (reading 'success')

[Killed] BooleanLiteral
src/db/insertTransaction.js:91:33
                 const [insert,update] = await sql.transaction(queries);
                 return {success:true,insert, update};
             }else{
-                return {success:false,message:"Invalid transaction type."};
+                return {success:true,message:"Invalid transaction type."};
             }
         } catch (error) {
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 15) invalid Transaction type
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
src/db/insertTransaction.js:93:25
             }else{
                 return {success:false,message:"Invalid transaction type."};
             }
-        } catch (error) {
-            console.error('Error inserting transaction:', error);
-            return null;
-        }
+        } catch (error) {}
     };
killedBy: insertTransaction (Strong, Mutation-Proof Tests) 10) DB SELECT fails → return null
statusReason: Error: expect(received).toBeNull()

Received: undefined
