[Killed] BlockStatement
src/db/insertUser.js:3:64
 import { sql } from "./dbConnection.js"; 
 
-const insertUser = async ({ name, email, Password, method}) => {
-    if(!name || !email || !Password || !method){
-        return null;
-    }
-    try {
-        const result = await sql`INSERT INTO "user" (name,email,password,registrationmethod) VALUES (${name},${email},${Password},${method})RETURNING id, email`;
-        if(!result) {
-            return null;
-        }
-        return result; 
-    } catch (error) {
-        console.error('Error inserting user:', error);
-        return null;
-    }
-}
+const insertUser = async ({ name, email, Password, method}) => {}
 export { insertUser };
killedBy: insertUser Database Function should return null if 'name' is missing
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] LogicalOperator
src/db/insertUser.js:4:8
 import { sql } from "./dbConnection.js"; 
 
 const insertUser = async ({ name, email, Password, method}) => {
-    if(!name || !email || !Password || !method){
+    if((!name || !email) && !Password || !method){
         return null;
     }
killedBy: insertUser Database Function should return null if 'name' is missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"user\" (name,email,password,registrationmethod) VALUES (", ",", ",", ",", ")RETURNING id, email"], undefined, "john@example.com", "hashed_password", "email"

[Killed] LogicalOperator
src/db/insertUser.js:4:8
 import { sql } from "./dbConnection.js"; 
 
 const insertUser = async ({ name, email, Password, method}) => {
-    if(!name || !email || !Password || !method){
+    if(!name && !email || !Password || !method){
         return null;
     }
killedBy: insertUser Database Function should return null if 'name' is missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: ["INSERT INTO \"user\" (name,email,password,registrationmethod) VALUES (", ",", ",", ",", ")RETURNING id, email"], undefined, "john@example.com", "hashed_password", "email"

[Killed] BlockStatement
src/db/insertUser.js:7:9
     if(!name || !email || !Password || !method){
         return null;
     }
-    try {
-        const result = await sql`INSERT INTO "user" (name,email,password,registrationmethod) VALUES (${name},${email},${Password},${method})RETURNING id, email`;
-        if(!result) {
-            return null;
-        }
-        return result; 
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error inserting user:', error);
         return null;
killedBy: insertUser Database Function should insert user and return DB response when all fields provided
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/db/insertUser.js:9:12
     }
     try {
         const result = await sql`INSERT INTO "user" (name,email,password,registrationmethod) VALUES (${name},${email},${Password},${method})RETURNING id, email`;
-        if(!result) {
+        if(false) {
             return null;
         }
killedBy: insertUser Database Function should return null if SQL returns undefined (kills undefined-return mutants)
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BooleanLiteral
src/db/insertUser.js:9:12
     }
     try {
         const result = await sql`INSERT INTO "user" (name,email,password,registrationmethod) VALUES (${name},${email},${Password},${method})RETURNING id, email`;
-        if(!result) {
+        if(result) {
             return null;
         }
killedBy: insertUser Database Function should insert user and return DB response when all fields provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: [{"email": "john@example.com", "id": 1}]
Received: null

[Killed] BlockStatement
src/db/insertUser.js:13:21
             return null;
         }
         return result; 
-    } catch (error) {
-        console.error('Error inserting user:', error);
-        return null;
-    }
+    } catch (error) {}
 }
 export { insertUser };
killedBy: insertUser Database Function should return null if SQL throws an error
statusReason: Error: expect(received).toBeNull()

Received: undefined
