[Killed] BlockStatement
src/db/stockSector.js:3:48
 import { sql } from "./dbConnection.js";
 
-export const getStocksSector = async(email) => {
-    try {
-        const result = await sql`SELECT 
-    ss.symbol,
-    ss.current_holding,
-    COALESCE(s.sector, 'Others') AS sector
-FROM 
-    stock_summary ss
-LEFT JOIN 
-    stocks s 
-    ON ss.symbol = s.symbol
-WHERE 
-    ss.email = ${email}`;
-        return result;
-    } catch (error) {
-        console.error('Stock sector fetch error:', error);
-        return null;
-    }
-};
+export const getStocksSector = async(email) => {};
killedBy: getStocksSector returns rows when query succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/db/stockSector.js:4:9
 import { sql } from "./dbConnection.js";
 
 export const getStocksSector = async(email) => {
-    try {
-        const result = await sql`SELECT 
-    ss.symbol,
-    ss.current_holding,
-    COALESCE(s.sector, 'Others') AS sector
-FROM 
-    stock_summary ss
-LEFT JOIN 
-    stocks s 
-    ON ss.symbol = s.symbol
-WHERE 
-    ss.email = ${email}`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Stock sector fetch error:', error);
         return null;
killedBy: getStocksSector returns rows when query succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/db/stockSector.js:17:21
 WHERE 
     ss.email = ${email}`;
         return result;
-    } catch (error) {
-        console.error('Stock sector fetch error:', error);
-        return null;
-    }
+    } catch (error) {}
 };
killedBy: getStocksSector returns null and logs error when sql throws
statusReason: Error: expect(received).toBeNull()

Received: undefined
