[Killed] BlockStatement
src/db/stockSummary.js:3:49
 import { sql } from "./dbConnection.js";
 
-export const getStockSummary = async (email) => {
-    try {
-        const result = await sql`SELECT * FROM "stock_summary" Where email=${email}`;
-        return result;
-    } catch (error) {
-        console.error('Stock details error:', error);
-        return null;
-    }
-};
+export const getStockSummary = async (email) => {};
 
 export const getPortfolioStockSummary = async (email) => {
killedBy: Stock Summary Service getStockSummary() returns stock summary when query succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/db/stockSummary.js:4:9
 import { sql } from "./dbConnection.js";
 
 export const getStockSummary = async (email) => {
-    try {
-        const result = await sql`SELECT * FROM "stock_summary" Where email=${email}`;
-        return result;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Stock details error:', error);
         return null;
killedBy: Stock Summary Service getStockSummary() returns stock summary when query succeeds
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/db/stockSummary.js:7:21
     try {
         const result = await sql`SELECT * FROM "stock_summary" Where email=${email}`;
         return result;
-    } catch (error) {
-        console.error('Stock details error:', error);
-        return null;
-    }
+    } catch (error) {}
 };
 
killedBy: Stock Summary Service getStockSummary() returns null when SQL throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined

[Killed] BlockStatement
src/db/stockSummary.js:17:21
     try {
         return result;
-    } catch (error) {
-        console.error('Database error - getPortfolioStockSummary',error);
-        return null;
-    }
+    } catch (error) {}
 };
killedBy: Stock Summary Service getPortfolioStockSummary() returns null when SQL throws error
statusReason: Error: expect(received).toBeNull()

Received: undefined
