[Killed] BlockStatement
src/controllers/dashBoard/getPortfolioInsight.controller.js:5:55
 
 /*----------------------------------------portfolio analysis invoke function--------------------------- */
 
-export const getPortfolioInsight = async (req,res) => {
-    try{
-        console.log("getPortfolioInsight called for user:", req.user?.email);
-        const context = {
-            configurable: {
-                thread_id: req.user?.email,
-                userDetails: {
-                    emailId: req.user?.email,
-                    name: req.user?.name || "User",
-                    financialGoals: req.user?.financialGoals || "not specified",
-                    investmentHorizon: req.user?.investmentHorizon || "not specified",
-                    investmentExperience: req.user?.investmentExperience || "not specified"
-                }
-            }
-        };
-        
-        const result = await Portfolio_analysis_tool.invoke({}, context);
-        // console.log("Portfolio Insight Result:", result);
-        return res.status(200).json({reply: result});
-    }
-    catch(err){
-        console.error("Error in portfolioAnalysisInvoke:", err);
-        res.status(500).json({ error: "Internal Server Error", details: err.message });
-    }
-}
+export const getPortfolioInsight = async (req,res) => {}
killedBy: getPortfolioInsight should call analysis tool with context from req.user and return 200 with reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}, ObjectContaining {"configurable": ObjectContaining {"thread_id": "user@example.com", "userDetails": ObjectContaining {"emailId": "user@example.com", "financialGoals": "Retirement", "investmentExperience": "Intermediate", "investmentHorizon": "10y", "name": "Alice"}}}

Number of calls: 0

[Killed] BlockStatement
src/controllers/dashBoard/getPortfolioInsight.controller.js:6:8
 /*----------------------------------------portfolio analysis invoke function--------------------------- */
 
 export const getPortfolioInsight = async (req,res) => {
-    try{
-        console.log("getPortfolioInsight called for user:", req.user?.email);
-        const context = {
-            configurable: {
-                thread_id: req.user?.email,
-                userDetails: {
-                    emailId: req.user?.email,
-                    name: req.user?.name || "User",
-                    financialGoals: req.user?.financialGoals || "not specified",
-                    investmentHorizon: req.user?.investmentHorizon || "not specified",
-                    investmentExperience: req.user?.investmentExperience || "not specified"
-                }
-            }
-        };
-        
-        const result = await Portfolio_analysis_tool.invoke({}, context);
-        // console.log("Portfolio Insight Result:", result);
-        return res.status(200).json({reply: result});
-    }
+    try{}
     catch(err){
         console.error("Error in portfolioAnalysisInvoke:", err);
killedBy: getPortfolioInsight should call analysis tool with context from req.user and return 200 with reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}, ObjectContaining {"configurable": ObjectContaining {"thread_id": "user@example.com", "userDetails": ObjectContaining {"emailId": "user@example.com", "financialGoals": "Retirement", "investmentExperience": "Intermediate", "investmentHorizon": "10y", "name": "Alice"}}}

Number of calls: 0

[Killed] OptionalChaining
src/controllers/dashBoard/getPortfolioInsight.controller.js:7:61
 
 export const getPortfolioInsight = async (req,res) => {
     try{
-        console.log("getPortfolioInsight called for user:", req.user?.email);
+        console.log("getPortfolioInsight called for user:", req.user.email);
         const context = {
             configurable: {
killedBy: getPortfolioInsight should handle missing req.user entirely without throwing and pass undefined email in context
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}, ObjectContaining {"configurable": ObjectContaining {"thread_id": undefined, "userDetails": ObjectContaining {"emailId": undefined, "financialGoals": "not specified", "investmentExperience": "not specified", "investmentHorizon": "not specified", "name": "User"}}}

Number of calls: 0

[Killed] OptionalChaining
src/controllers/dashBoard/getPortfolioInsight.controller.js:10:28
         console.log("getPortfolioInsight called for user:", req.user?.email);
         const context = {
             configurable: {
-                thread_id: req.user?.email,
+                thread_id: req.user.email,
                 userDetails: {
                     emailId: req.user?.email,
killedBy: getPortfolioInsight should handle missing req.user entirely without throwing and pass undefined email in context
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}, ObjectContaining {"configurable": ObjectContaining {"thread_id": undefined, "userDetails": ObjectContaining {"emailId": undefined, "financialGoals": "not specified", "investmentExperience": "not specified", "investmentHorizon": "not specified", "name": "User"}}}

Number of calls: 0

[Killed] OptionalChaining
src/controllers/dashBoard/getPortfolioInsight.controller.js:12:30
             configurable: {
                 thread_id: req.user?.email,
                 userDetails: {
-                    emailId: req.user?.email,
+                    emailId: req.user.email,
                     name: req.user?.name || "User",
                     financialGoals: req.user?.financialGoals || "not specified",
killedBy: getPortfolioInsight should handle missing req.user entirely without throwing and pass undefined email in context
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}, ObjectContaining {"configurable": ObjectContaining {"thread_id": undefined, "userDetails": ObjectContaining {"emailId": undefined, "financialGoals": "not specified", "investmentExperience": "not specified", "investmentHorizon": "not specified", "name": "User"}}}

Number of calls: 0

[Killed] OptionalChaining
src/controllers/dashBoard/getPortfolioInsight.controller.js:14:37
                 userDetails: {
                     emailId: req.user?.email,
                     name: req.user?.name || "User",
-                    financialGoals: req.user?.financialGoals || "not specified",
+                    financialGoals: req.user.financialGoals || "not specified",
                     investmentHorizon: req.user?.investmentHorizon || "not specified",
                     investmentExperience: req.user?.investmentExperience || "not specified"
killedBy: getPortfolioInsight should handle missing req.user entirely without throwing and pass undefined email in context
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}, ObjectContaining {"configurable": ObjectContaining {"thread_id": undefined, "userDetails": ObjectContaining {"emailId": undefined, "financialGoals": "not specified", "investmentExperience": "not specified", "investmentHorizon": "not specified", "name": "User"}}}

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/dashBoard/getPortfolioInsight.controller.js:14:37
                 userDetails: {
                     emailId: req.user?.email,
                     name: req.user?.name || "User",
-                    financialGoals: req.user?.financialGoals || "not specified",
+                    financialGoals: false,
                     investmentHorizon: req.user?.investmentHorizon || "not specified",
                     investmentExperience: req.user?.investmentExperience || "not specified"
killedBy: getPortfolioInsight should call analysis tool with context from req.user and return 200 with reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {},
- ObjectContaining {"configurable": ObjectContaining {"thread_id": "user@example.com", "userDetails": ObjectContaining {"emailId": "user@example.com", "financialGoals": "Retirement", "investmentExperience": "Intermediate", "investmentHorizon": "10y", "name": "Alice"}}},
+ {"configurable": {"thread_id": "user@e

[Killed] LogicalOperator
src/controllers/dashBoard/getPortfolioInsight.controller.js:15:40
                     emailId: req.user?.email,
                     name: req.user?.name || "User",
                     financialGoals: req.user?.financialGoals || "not specified",
-                    investmentHorizon: req.user?.investmentHorizon || "not specified",
+                    investmentHorizon: req.user?.investmentHorizon && "not specified",
                     investmentExperience: req.user?.investmentExperience || "not specified"
                 }
killedBy: getPortfolioInsight should call analysis tool with context from req.user and return 200 with reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {},
- ObjectContaining {"configurable": ObjectContaining {"thread_id": "user@example.com", "userDetails": ObjectContaining {"emailId": "user@example.com", "financialGoals": "Retirement", "investmentExperience": "Intermediate", "investmentHorizon": "10y", "name": "Alice"}}},
+ {"configurable": {"thread_id": "user@e

[Killed] OptionalChaining
src/controllers/dashBoard/getPortfolioInsight.controller.js:15:40
                     emailId: req.user?.email,
                     name: req.user?.name || "User",
                     financialGoals: req.user?.financialGoals || "not specified",
-                    investmentHorizon: req.user?.investmentHorizon || "not specified",
+                    investmentHorizon: req.user.investmentHorizon || "not specified",
                     investmentExperience: req.user?.investmentExperience || "not specified"
                 }
killedBy: getPortfolioInsight should handle missing req.user entirely without throwing and pass undefined email in context
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {}, ObjectContaining {"configurable": ObjectContaining {"thread_id": undefined, "userDetails": ObjectContaining {"emailId": undefined, "financialGoals": "not specified", "investmentExperience": "not specified", "investmentHorizon": "not specified", "name": "User"}}}

Number of calls: 0

[Killed] ConditionalExpression
src/controllers/dashBoard/getPortfolioInsight.controller.js:16:43
                     name: req.user?.name || "User",
                     financialGoals: req.user?.financialGoals || "not specified",
                     investmentHorizon: req.user?.investmentHorizon || "not specified",
-                    investmentExperience: req.user?.investmentExperience || "not specified"
+                    investmentExperience: false
                 }
             }
killedBy: getPortfolioInsight should call analysis tool with context from req.user and return 200 with reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {},
- ObjectContaining {"configurable": ObjectContaining {"thread_id": "user@example.com", "userDetails": ObjectContaining {"emailId": "user@example.com", "financialGoals": "Retirement", "investmentExperience": "Intermediate", "investmentHorizon": "10y", "name": "Alice"}}},
+ {"configurable": {"thread_id": "user@e

[Killed] ConditionalExpression
src/controllers/dashBoard/getPortfolioInsight.controller.js:16:43
                     name: req.user?.name || "User",
                     financialGoals: req.user?.financialGoals || "not specified",
                     investmentHorizon: req.user?.investmentHorizon || "not specified",
-                    investmentExperience: req.user?.investmentExperience || "not specified"
+                    investmentExperience: true
                 }
             }
killedBy: getPortfolioInsight should call analysis tool with context from req.user and return 200 with reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  {},
- ObjectContaining {"configurable": ObjectContaining {"thread_id": "user@example.com", "userDetails": ObjectContaining {"emailId": "user@example.com", "financialGoals": "Retirement", "investmentExperience": "Intermediate", "investmentHorizon": "10y", "name": "Alice"}}},
+ {"configurable": {"thread_id": "user@e

[Killed] BlockStatement
src/controllers/dashBoard/getPortfolioInsight.controller.js:25:15
         // console.log("Portfolio Insight Result:", result);
         return res.status(200).json({reply: result});
     }
-    catch(err){
-        console.error("Error in portfolioAnalysisInvoke:", err);
-        res.status(500).json({ error: "Internal Server Error", details: err.message });
-    }
+    catch(err){}
 }
killedBy: getPortfolioInsight should return 500 and error payload when analysis tool throws
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0
