[Killed] BlockStatement
src/controllers/aiInsight/sendMessage.controller.js:5:8
 
 // -------------------------------------------------sendMessage controller----------------------------------------
 export const sendMessage = async (req, res) => {
-    try{
-        const userDetails = {
-            emailId: req.user?.email,
-            name: req.user?.name || "User",
-            profileImage: req.user?.profileimage,
-            riskProfile: req.user?.riskprofile,
-            investmentExperience: req.user?.investmentexperience,
-            themePreferences: req.user?.theme,
-            aiSuggestionsEnabled: req.user?.aisuggestion,
-            financialGoals: req.user?.financialgoals,
-            investmentHorizon: req.user?.investmenthorizon,
-        }
-        const {message} = req.body;
-        if(!message) return res.status(400).json({error : "message is required"});
-        const result = await app.invoke({
-            messages : [{ role: "user", content: message.text,additional_kwargs: { userDetails: userDetails ,screenWidth: message.screenWidth} }]
-        },{
-            configurable : {
-                thread_id : userDetails.emailId,
-                userDetails: userDetails, 
-            }
-        });
-        let reply = result.messages.at(-1)?.content;
-        return res.status(200).json({reply});
-    } catch (err) {
+    try{} catch (err) {
         console.log("Agent Error:", err);
         return res.status(500).json({ error: "Internal Server Error", details: err.message });
killedBy: sendMessage controller should return 400 when message is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400

Number of calls: 0

[Killed] ObjectLiteral
src/controllers/aiInsight/sendMessage.controller.js:6:29
 // -------------------------------------------------sendMessage controller----------------------------------------
 export const sendMessage = async (req, res) => {
     try{
-        const userDetails = {
-            emailId: req.user?.email,
-            name: req.user?.name || "User",
-            profileImage: req.user?.profileimage,
-            riskProfile: req.user?.riskprofile,
-            investmentExperience: req.user?.investmentexperience,
-            themePreferences: req.user?.theme,
-            aiSuggestionsEnabled: req.user?.aisuggestion,
-            financialGoals: req.user?.financialgoals,
-            investmentHorizon: req.user?.investmenthorizon,
-        }
+        const userDetails = {}
         const {message} = req.body;
         if(!message) return res.status(400).json({error : "message is required"});
killedBy: sendMessage controller should call app.invoke with correct payload and return 200 with reply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 11
+ Received  +  1

@@ -1,21 +1,11 @@
  Object {
    "messages": Array [

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:7:22
 export const sendMessage = async (req, res) => {
     try{
         const userDetails = {
-            emailId: req.user?.email,
+            emailId: req.user.email,
             name: req.user?.name || "User",
             profileImage: req.user?.profileimage,
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/controllers/aiInsight/sendMessage.controller.js:8:19
     try{
         const userDetails = {
             emailId: req.user?.email,
-            name: req.user?.name || "User",
+            name: false,
             profileImage: req.user?.profileimage,
             riskProfile: req.user?.riskprofile,
killedBy: sendMessage controller should call app.invoke with correct payload and return 200 with reply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
            "aiSuggestionsEnabled": true,
            "emailId": "a@b.com",

[Killed] ConditionalExpression
src/controllers/aiInsight/sendMessage.controller.js:8:19
     try{
         const userDetails = {
             emailId: req.user?.email,
-            name: req.user?.name || "User",
+            name: true,
             profileImage: req.user?.profileimage,
             riskProfile: req.user?.riskprofile,
killedBy: sendMessage controller should call app.invoke with correct payload and return 200 with reply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -7,11 +7,11 @@
            "aiSuggestionsEnabled": true,
            "emailId": "a@b.com",

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:9:27
         const userDetails = {
             emailId: req.user?.email,
             name: req.user?.name || "User",
-            profileImage: req.user?.profileimage,
+            profileImage: req.user.profileimage,
             riskProfile: req.user?.riskprofile,
             investmentExperience: req.user?.investmentexperience,
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:10:26
             emailId: req.user?.email,
             name: req.user?.name || "User",
             profileImage: req.user?.profileimage,
-            riskProfile: req.user?.riskprofile,
+            riskProfile: req.user.riskprofile,
             investmentExperience: req.user?.investmentexperience,
             themePreferences: req.user?.theme,
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:11:35
             name: req.user?.name || "User",
             profileImage: req.user?.profileimage,
             riskProfile: req.user?.riskprofile,
-            investmentExperience: req.user?.investmentexperience,
+            investmentExperience: req.user.investmentexperience,
             themePreferences: req.user?.theme,
             aiSuggestionsEnabled: req.user?.aisuggestion,
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:12:31
             profileImage: req.user?.profileimage,
             riskProfile: req.user?.riskprofile,
             investmentExperience: req.user?.investmentexperience,
-            themePreferences: req.user?.theme,
+            themePreferences: req.user.theme,
             aiSuggestionsEnabled: req.user?.aisuggestion,
             financialGoals: req.user?.financialgoals,
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:13:35
             riskProfile: req.user?.riskprofile,
             investmentExperience: req.user?.investmentexperience,
             themePreferences: req.user?.theme,
-            aiSuggestionsEnabled: req.user?.aisuggestion,
+            aiSuggestionsEnabled: req.user.aisuggestion,
             financialGoals: req.user?.financialgoals,
             investmentHorizon: req.user?.investmenthorizon,
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:14:29
             investmentExperience: req.user?.investmentexperience,
             themePreferences: req.user?.theme,
             aiSuggestionsEnabled: req.user?.aisuggestion,
-            financialGoals: req.user?.financialgoals,
+            financialGoals: req.user.financialgoals,
             investmentHorizon: req.user?.investmenthorizon,
         }
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:15:32
             themePreferences: req.user?.theme,
             aiSuggestionsEnabled: req.user?.aisuggestion,
             financialGoals: req.user?.financialgoals,
-            investmentHorizon: req.user?.investmenthorizon,
+            investmentHorizon: req.user.investmenthorizon,
         }
         const {message} = req.body;
killedBy: sendMessage controller should use optional chaining safely when req.user is undefined
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BooleanLiteral
src/controllers/aiInsight/sendMessage.controller.js:18:12
             investmentHorizon: req.user?.investmenthorizon,
         }
         const {message} = req.body;
-        if(!message) return res.status(400).json({error : "message is required"});
+        if(message) return res.status(400).json({error : "message is required"});
         const result = await app.invoke({
             messages : [{ role: "user", content: message.text,additional_kwargs: { userDetails: userDetails ,screenWidth: message.screenWidth} }]
killedBy: sendMessage controller should return 400 when message is missing
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 400
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
src/controllers/aiInsight/sendMessage.controller.js:18:12
             investmentHorizon: req.user?.investmenthorizon,
         }
         const {message} = req.body;
-        if(!message) return res.status(400).json({error : "message is required"});
+        if(true) return res.status(400).json({error : "message is required"});
         const result = await app.invoke({
             messages : [{ role: "user", content: message.text,additional_kwargs: { userDetails: userDetails ,screenWidth: message.screenWidth} }]
killedBy: sendMessage controller should call app.invoke with correct payload and return 200 with reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrayDeclaration
src/controllers/aiInsight/sendMessage.controller.js:20:24
         const {message} = req.body;
         if(!message) return res.status(400).json({error : "message is required"});
         const result = await app.invoke({
-            messages : [{ role: "user", content: message.text,additional_kwargs: { userDetails: userDetails ,screenWidth: message.screenWidth} }]
+            messages : []
         },{
             configurable : {
killedBy: sendMessage controller should call app.invoke with correct payload and return 200 with reply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 20
+ Received  +  1

  Object {
-   "messages": Array [
-     Object {

[Killed] ObjectLiteral
src/controllers/aiInsight/sendMessage.controller.js:22:28
         const result = await app.invoke({
             messages : [{ role: "user", content: message.text,additional_kwargs: { userDetails: userDetails ,screenWidth: message.screenWidth} }]
         },{
-            configurable : {
-                thread_id : userDetails.emailId,
-                userDetails: userDetails, 
-            }
+            configurable : {}
         });
         let reply = result.messages.at(-1)?.content;
killedBy: sendMessage controller should call app.invoke with correct payload and return 200 with reply
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

  Object {
-   "configurable": Object {
-     "thread_id": "a@b.com",

[Killed] UnaryOperator
src/controllers/aiInsight/sendMessage.controller.js:27:40
                 userDetails: userDetails, 
             }
         });
-        let reply = result.messages.at(-1)?.content;
+        let reply = result.messages.at(+1)?.content;
         return res.status(200).json({reply});
     } catch (err) {
killedBy: sendMessage controller should pick the last message content as reply
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "reply": "final",
+   "reply": "second",

[Survived] OptionalChaining
src/controllers/aiInsight/sendMessage.controller.js:27:21
                 userDetails: userDetails, 
             }
         });
-        let reply = result.messages.at(-1)?.content;
+        let reply = result.messages.at(-1).content;
         return res.status(200).json({reply});
     } catch (err) {

[Killed] BlockStatement
src/controllers/aiInsight/sendMessage.controller.js:29:19
         });
         let reply = result.messages.at(-1)?.content;
         return res.status(200).json({reply});
-    } catch (err) {
-        console.log("Agent Error:", err);
-        return res.status(500).json({ error: "Internal Server Error", details: err.message });
-    }
+    } catch (err) {}
 
 }
killedBy: sendMessage controller should handle agent errors and return 500 with details
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] ObjectLiteral
src/controllers/aiInsight/sendMessage.controller.js:31:37
         return res.status(200).json({reply});
     } catch (err) {
         console.log("Agent Error:", err);
-        return res.status(500).json({ error: "Internal Server Error", details: err.message });
+        return res.status(500).json({});
     }
 
killedBy: sendMessage controller should handle agent errors and return 500 with details
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "details": "boom",
-   "error": "Internal Server Error",
